{
  "jokes": [
    "Why don't scientists trust atoms? Because they make up everything!",
    "I used to hate facial hair, but then it grew on me.",
    "What do you call a factory that makes okay products? A satisfactory.",
    "I'm reading a book about anti-gravity. It's impossible to put down!",
    "Why did the scarecrow win an award? He was outstanding in his field!",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "What do you call a belt made of watches? A waist of time!",
    "I'm afraid for the calendar. Its days are numbered.",
    "Why don't eggs tell jokes? They'd crack each other up.",
    "What do you call cheese that isn't yours? Nacho cheese!",
    "Why did the bicycle fall over? It was two tired.",
    "How do you organize a space party? You planet!",
    "What's orange and sounds like a parrot? A carrot!",
    "Why can't your nose be 12 inches long? Because then it would be a foot!",
    "What do you call a fake noodle? An impasta!",
    "Did you hear about the restaurant on the moon? Great food, no atmosphere.",
    "Why did the coffee file a police report? It got mugged!",
    "What do you call a bear with no teeth? A gummy bear!",
    "How does a penguin build its house? Igloos it together!",
    "Why don't skeletons fight each other? They don't have the guts.",
    "What did the ocean say to the beach? Nothing, it just waved.",
    "Why did the math book look sad? It had too many problems.",
    "What do you call a sleeping bull? A bulldozer!",
    "How do you make a tissue dance? You put a little boogie in it!",
    "What's the best time to go to the dentist? Tooth-hurty!",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one!",
    "What do you call a fish wearing a bowtie? Sofishticated!",
    "Why couldn't the leopard play hide and seek? Because he was always spotted!",
    "What do you call an alligator in a vest? An investigator!",
    "How do you catch a squirrel? Climb a tree and act like a nut!",
    "Why did the tomato turn red? Because it saw the salad dressing!",
    "What do you call a pile of cats? A meowtain!",
    "Why don't oysters donate to charity? Because they're shellfish!",
    "What did the grape do when he got stepped on? He let out a little wine!",
    "Why did the cookie go to the doctor? Because it felt crumbly!",
    "What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks!",
    "How do you make holy water? You boil the hell out of it!",
    "What do you call a snowman with a six-pack? An abdominal snowman!",
    "Why did the stadium get hot after the game? All the fans left!",
    "What do you call a boomerang that won't come back? A stick!",
    "Why don't scientists trust stairs? Because they're always up to something!",
    "What did the janitor say when he jumped out of the closet? Supplies!",
    "Why did the yogurt go to the art museum? Because it was cultured!",
    "What do you call a can opener that doesn't work? A can't opener!",
    "Why did the computer go to the doctor? It had a virus!",
    "What do you call a magic dog? A labracadabrador!",
    "Why don't seagulls fly over the bay? Because then they'd be bagels!",
    "What did one wall say to the other wall? I'll meet you at the corner!",
    "Why did the belt go to jail? For holding up a pair of pants!",
    "What do you call a parade of rabbits hopping backwards? A receding hare-line!",
    "Why did the picture go to jail? Because it was framed!",
    "What do you call a sleeping dinosaur? A dino-snore!",
    "Why did the student eat his homework? Because the teacher said it was a piece of cake!",
    "What do you call a bear in the rain? A drizzly bear!",
    "Why don't mountains get cold in winter? They wear snow caps!",
    "What did the buffalo say when his son left for college? Bison!",
    "Why did the mushroom go to the party? Because he was a fungi!",
    "What do you call a lazy kangaroo? A pouch potato!",
    "Why did the invisible man turn down the job offer? He couldn't see himself doing it!",
    "What do you call a fake stone? A sham rock!",
    "Why did the banker switch careers? He lost interest!",
    "What do you call a shoe made of a banana? A slipper!",
    "Why did the chicken join a band? Because it had the drumsticks!",
    "What do you call a group of unorganized cats? A cat-astrophe!",
    "Why did the barber win the race? He knew a shortcut!",
    "What do you call a cold dog? A chili dog!",
    "Why did the carpenter fall asleep on the job? He was board!",
    "What do you call a pig that does karate? A pork chop!",
    "Why did the melon jump into the lake? It wanted to be a watermelon!",
    "What do you call a deer with no eyes? No idea!",
    "Why did the bicycle stand up by itself? It was two-tired of leaning!",
    "What do you call a deer with no eyes and no legs? Still no idea!",
    "Why did the gym close down? It just didn't work out!",
    "What do you call a singing laptop? A Dell!",
    "Why did the scarecrow become a successful motivational speaker? He was outstanding in his field!",
    "What do you call a line of men waiting to get haircuts? A barber-queue!",
    "Why did the donut go to the dentist? It needed a filling!",
    "What do you call a cow with no legs? Ground beef!",
    "Why did the chicken go to the seance? To talk to the other side!",
    "What do you call a cow during an earthquake? A milkshake!",
    "Why did the man put his money in the freezer? He wanted cold hard cash!",
    "What do you call a monkey that loves chips? A chipmunk!",
    "Why did the envelope go to school? To get first class mail!",
    "What do you call birds that stick together? Vel-crows!",
    "Why did the baker stop making donuts? He got tired of the hole business!",
    "What do you call a very religious person that sleepwalks? A roamin' Catholic!",
    "Why did the hipster burn his mouth? He drank his coffee before it was cool!",
    "What do you call a Spanish guy who lost his car? Carlos!",
    "Why did the frog take the bus to work? His car got toad away!",
    "What do you call a bee that can't make up its mind? A maybe!",
    "Why did the PowerPoint presentation cross the road? To get to the other slide!",
    "What do you call a pony with a sore throat? A little hoarse!",
    "Why did the coach go to the bank? To get his quarterback!",
    "What do you call an elephant that doesn't matter? An irrelephant!",
    "Why did the burglar take a bath? He wanted to make a clean getaway!",
    "What do you call a man with a rubber toe? Roberto!",
    "Why did the orange stop in the middle of the road? It ran out of juice!",
    "What do you call a fish with two knees? A two-knee fish!",
    "Why did the cookie cry? Because his mother was a wafer so long!",
    "What do you call a pile of kittens? A meow-tain!",
    "Why did the golfer wear two pairs of socks? In case he got a hole in one!",
    "What do you call a detective alligator? An investi-gator!",
    "Why did the lettuce win the race? Because it was ahead!",
    "What do you call a group of musical whales? An orca-stra!",
    "Why did the cookie go to the hospital? Because he felt crummy!",
    "What do you call a funny mountain? Hill-arious!",
    "Why did the tree go to the dentist? To get a root canal!",
    "What do you call a beautiful pumpkin? Gourd-geous!",
    "Why did the man fall down the well? Because he couldn't see that well!",
    "What do you call a cow that plays guitar? A moo-sician!",
    "Why did the golfer bring an extra pair of pants? In case he got a hole in one!",
    "What do you call someone with no body and no nose? Nobody knows!",
    "Why did the computer sneeze? It had a virus!",
    "What do you call a train loaded with toffee? A chew-chew train!",
    "Why did the stadium get so hot? All the fans left!",
    "What do you call a dinosaur with an extensive vocabulary? A thesaurus!",
    "Why did the tomato blush? Because it saw the salad dressing!",
    "What do you call a sleeping pizza? A piZZZa!",
    "Why did the banana go to the doctor? It wasn't peeling well!",
    "What do you call an apology written in dots and dashes? Re-morse code!",
    "Why did the librarian get kicked off the plane? It was overbooked!",
    "What do you call a fish without eyes? Fsh!",
    "Why did the golfer change his pants? Because he got a hole in one!",
    "What do you call a broken can opener? A can't opener!",
    "Why did the crab never share? Because he was shellfish!",
    "What do you call a dinosaur fart? A blast from the past!",
    "Why did the kid throw his clock out the window? He wanted to see time fly!",
    "What do you call a snowman in July? A puddle!",
    "Why did the nurse need a red pen? In case she needed to draw blood!",
    "What do you call a duck that gets all A's? A wise quacker!",
    "Why did the woman bring a ladder to the bar? She heard the drinks were on the house!",
    "What do you call a sheep with no legs? A cloud!",
    "Why did the phone wear glasses? Because it lost its contacts!",
    "What do you call a grumpy cow? Moody!",
    "Why did the belt get arrested? For holding up the pants!",
    "What do you call a Mexican that lost his car? Car-los!",
    "Why did the toilet paper roll down the hill? To get to the bottom!",
    "What do you call a laughing motorcycle? A Yamahahaha!",
    "Why did the scarecrow get promoted? He was outstanding in his field!",
    "What do you call a sleeping T-Rex? A dino-snore!",
    "Why did the cookie go to the nurse? Because he felt crumbly!",
    "What do you call a dog magician? A labracadabrador!",
    "Why did the stadium go to therapy? It had too many issues!",
    "What do you call an alligator detective? An investi-gator!",
    "Why did the math book look worried? It had too many problems!",
    "What do you call a parade of rabbits? A receding hare-line!",
    "Why did the clock get in trouble? It tocked too much!",
    "What do you call a sketchy Italian neighborhood? The spaghetto!",
    "Why did the coffee taste like mud? It was ground that morning!",
    "What do you call a sheep covered in chocolate? A candy baa!",
    "Why did the bicycle quit its job? It was two-tired!",
    "What do you call a belt with a watch on it? A waist of time!",
    "Why did the student bring a ladder to school? To go to high school!",
    "What do you call a snowman party? A snowball!",
    "Why did the chicken get a penalty? For fowl play!",
    "What do you call an ant who fights crime? A vigil-ant-e!",
    "Why did the computer keep freezing? It left its Windows open!",
    "What do you call a knight who's afraid of everything? Sir Render!",
    "Why did the astronaut break up with his girlfriend? He needed space!",
    "What do you call a sleeping werewolf? An unaware-wolf!",
    "Why did the music teacher need a ladder? To reach the high notes!",
    "What do you call an illegally parked frog? Toad!",
    "Why did the pirate go to school? To improve his ARRRRticulation!",
    "What do you call a pig that knows karate? A pork chop!",
    "Why did the quarter not roll down the hill with the nickel? Because it had more cents!",
    "What do you call a sad strawberry? A blueberry!",
    "Why did the sun go to school? To get brighter!",
    "What do you call a fancy fish? So-fish-ticated!",
    "Why did the raisin go out with the prune? Because he couldn't find a date!",
    "What do you call a woman standing in the middle of a tennis court? Annette!",
    "Why did the vacuum cleaner quit? It was tired of being pushed around!",
    "What do you call a boomerang that doesn't work? A stick!",
    "Why did the clock in the cafeteria run slow? It always went back four seconds!",
    "What do you call a T-Rex that's been beaten up? Dino-sore!",
    "Why did the house go to the doctor? It had window panes!",
    "What do you call a nervous javelin thrower? Shakespeare!",
    "Why did the farmer win an award? He was out standing in his field!",
    "What do you call a zipper on a banana? A fruit fly!",
    "Why did the girl bring a pencil to bed? To draw the curtains!",
    "What do you call a religious person who sleepwalks? A roamin' Catholic!",
    "Why did the kid study in the airplane? He wanted a higher education!",
    "What do you call a deer at a disco? A dee-jay!",
    "Why did the photon check into a hotel with no luggage? He was traveling light!",
    "What do you call a priest that becomes a lawyer? A father-in-law!",
    "Why did the Oreo go to the dentist? It lost its filling!",
    "What do you call a sleeping bull? A bulldozer!",
    "Why did the bicycle keep falling over? It was two-tired!",
    "What do you call a row of people lifting a giant mozzarella? A cheesy pickup line!",
    "Why did the stadium get so loud? The fans were going wild!",
    "What do you call a man who can't stand? Neil!",
    "Why did the tree get in trouble? For being knotty!",
    "What do you call a fake Italian? An im-pasta!",
    "Why did the banana split? Because it saw the ice cream!",
    "What do you call a shoe made from banana peel? A slipper!",
    "Why did the orange go to the doctor? It wasn't peeling well!",
    "What do you call a sleeping bag? Napsack!",
    "Why did the window go to school? To become a pane-el expert!",
    "What do you call a bear with no ears? B!",
    "Why did the egg hide? It was a little chicken!",
    "What do you call a fake noodle? An impasta!",
    "Why did the cookie need a doctor? It was feeling crumbly!",
    "What do you call someone who doesn't fart in public? A private tutor!",
    "Why did the chicken cross the playground? To get to the other slide!",
    "What do you call a can of soda in a tree? Coca-Koala!",
    "Why did the skeleton go to the party alone? He had no-body to go with!",
    "What do you call a cow with a twitch? Beef jerky!",
    "Why did the fish blush? It saw the ocean's bottom!",
    "What do you call a computer that sings? A-Dell!",
    "Why did the egg go to therapy? It was cracking under pressure!",
    "What do you call a paper airplane that can't fly? Stationary!",
    "Why did the picture go to prison? It was framed!",
    "What do you call a owl that does magic? Hoo-dini!",
    "Why did the gum cross the road? It was stuck to the chicken's foot!",
    "What do you call a lazy bull? A bull-dozer!",
    "Why did the baker rob the bank? He needed the dough!",
    "What do you call a penguin in the desert? Lost!",
    "Why did the farmer ride his horse to town? It was too heavy to carry!",
    "What do you call a group of killer whales playing instruments? An orca-stra!",
    "Why did the calendar go to therapy? Its days were numbered!",
    "What do you call an underwater spy? James Pond!",
    "Why did the cell phone get glasses? It lost its contacts!",
    "What do you call a broken elevator? A let-down!",
    "Why did the salad go to the spa? To get dressed!",
    "What do you call a row of rabbits walking backwards? A receding hare line!",
    "Why did the teddy bear say no to dessert? She was stuffed!",
    "What do you call a psychic little person who escaped prison? A small medium at large!",
    "Why did the invisible man fail math? He wasn't even counted!",
    "What do you call an old snowman? Water!",
    "Why did the coffee go to the police? It got mugged!",
    "What do you call a nosy pepper? Jalapeño business!",
    "Why did the balloon go near the needle? He wanted to be a pop star!",
    "What do you call a dinosaur that never gives up? Try-ceratops!",
    "Why did the golfer carry an umbrella? For the hole in one!",
    "What do you call a cheese that's not yours? Nacho cheese!",
    "Why did the mushroom get invited to parties? He was a fungi!",
    "What do you call a group of disorganized cats? A cat-astrophe!",
    "Why did the donut visit the dentist? It needed a filling!",
    "What do you call a well-balanced horse? Stable!",
    "Why did the plant go to the doctor? It had a bad case of soil!",
    "What do you call a running turkey? Fast food!",
    "Why did the blanket go to the doctor? It had the chills!",
    "What do you call a sleeping pizza? A piZZZa!",
    "Why did the drum go to bed? It was beat!",
    "What do you call a sad coffee? A depresso!",
    "Why did the golfer bring two pairs of shoes? In case he got a hole in one!",
    "What do you call a chicken looking at lettuce? Chicken sees a salad!",
    "Why did the robot go on vacation? He needed to recharge his batteries!",
    "What do you call a boomerang that won't come back? A stick!",
    "Why did the rope go to school? To get more knowledge knots!",
    "What do you call a smiling Roman soldier with hair in his teeth? A glad-he-ate-her!",
    "Why did the laptop go to the chiropractor? It had a slipped disc!",
    "What do you call a religious insect? A mosque-ito!",
    "Why did the duck go to rehab? He was a quack addict!",
    "What do you call a dinosaur with a great vocabulary? A thesaurus!",
    "Why did the skeleton climb the tree? Because a dog was after his bones!",
    "What do you call a happy cowboy? A jolly rancher!",
    "Why did the snail paint a big S on his car? So people would say 'Look at that S-car-go!'",
    "What do you call a dog that can do magic tricks? A labracadabrador!",
    "Why did the pony get sent to his room? He wouldn't stop horsing around!",
    "What do you call a nervous javelin? Shakespeare!",
    "Why did the chicken cross the Mobius strip? To get to the same side!",
    "What do you call a camel with three humps? Pregnant!",
    "Why did the golfer change his socks? He got a hole in one!",
    "What do you call two monkeys sharing an Amazon account? Prime mates!",
    "Why did the horseradish go to the doctor? It was feeling a little hoarse!",
    "What do you call a belt made out of watches? A waist of time!",
    "Why did the stadium flood? The fans were going crazy!",
    "What do you call a monkey in a minefield? A baboom!",
    "Why did the picture get arrested? It was framed!",
    "What do you call a factory that sells good products? A satisfactory!",
    "Why did the fish get bad grades? Because it was below sea level!",
    "What do you call a parade of rabbits hopping backward? A receding hare-line!",
    "Why did the cell phone wear glasses? It lost its contacts!",
    "What do you call a bear caught in the rain? A drizzly bear!",
    "Why did the guy get fired from the orange juice factory? Lack of concentration!",
    "What do you call a sleeping bag? Napsack!",
    "Why did the scarecrow win the Nobel Prize? He was out standing in his field!",
    "What do you call an acid with an attitude? A-mean-o acid!",
    "Why did the M&M go to school? It wanted to be a Smartie!",
    "What do you call a tooth in a glass of water? One molar solution!",
    "Why did the cookie see the doctor? Because it was feeling crumbly!",
    "What do you call a fly without wings? A walk!",
    "Why did the boy bring a ladder to chorus? To reach the high notes!",
    "What do you call a cow eating grass? A lawn moo-er!",
    "Why did the computer go to art school? To learn how to draw conclusions!",
    "What do you call a thieving alligator? A crook-odile!",
    "Why did the chicken cross the beach? To get to the other tide!",
    "What do you call a kangaroo at the North Pole? Lost!",
    "Why did the tree see a doctor? It had a bad case of bark!",
    "What do you call a very small Valentine? A valen-tiny!",
    "Why did the donut go to the doctor? He was feeling glazed and confused!",
    "What do you call a bear that's stuck in the rain? A drizzly bear!",
    "Why did the cookie cry? Because his mom was a wafer so long!",
    "What do you call an attractive volcano? Lava-ly!",
    "Why did the clock get detention? For tocking in class!",
    "What do you call a pig doing karate? A pork chop!",
    "Why did the dinosaur cross the road? Because chickens hadn't evolved yet!",
    "What do you call a sheep with no head and no legs? A cloud!",
    "Why did the coffee taste like dirt? It was ground this morning!",
    "What do you call a fake Irish stone? A sham rock!",
    "Why did the smartphone need glasses? It lost all its contacts!",
    "What do you call a rabbit who tells jokes? A funny bunny!",
    "Why did the bicycle say ouch? It had a spoke in its wheel!",
    "What do you call a pile of kittens? A meow-ntain!",
    "Why did the frog call his insurance company? He had a jump in his car!",
    "What do you call a sleeping dinosaur? A dino-snore!",
    "Why did the tomato turn green? It wasn't ripe yet!",
    "What do you call a lazy doctor? Dr. Do-Little!",
    "Why did the banana go out with the prune? Because it couldn't get a date!",
    "What do you call a medieval soldier who survived the plague? A sur-vivor!",
    "Why did the man put his car in the oven? He wanted a hot rod!",
    "What do you call a droid that takes the long way? R2-Detour!",
    "Why did the envelope go to school? To get first class!",
    "What do you call birds that stick together? Velcrows!",
    "Why did the golfer wear an extra pair of pants? In case he got a hole in one!",
    "What do you call a Mexican who lost his car? Carlos!",
    "Why did the photograph go to jail? It was framed!",
    "What do you call an elephant that doesn't matter? Irrelephant!",
    "Why did the toilet paper roll down the hill? To get to the bottom!",
    "What do you call a cow with two legs? Lean beef!",
    "Why did the old man fall in the well? Because he couldn't see that well!",
    "What do you call a man lying on your doorstep? Matt!",
    "Why did the baker stop making donuts? He was tired of the hole business!",
    "What do you call a sleeping T-Rex? Dino-snore!",
    "Why did the stadium get warm? All the fans left!",
    "What do you call a pile of puppies? A litter!",
    "Why did the computer get cold? It left its Windows open!",
    "What do you call a fake stone in Ireland? A shamrock!",
    "Why did the girl smear peanut butter on the road? To go with the traffic jam!",
    "What do you call a deer with no eyes? No eye-deer!",
    "Why did the kid eat his homework? The teacher said it was a piece of cake!",
    "What do you call a sketchy neighborhood in Italy? The spaghetto!",
    "Why did the man get fired from the calendar factory? He took a day off!",
    "What do you call a stolen Tesla? An Edison!",
    "Why did the chicken go to KFC? To see a chicken strip!",
    "What do you call a group of musical whales? An orca-stra!",
    "Why did the scarecrow become a successful neurosurgeon? He was outstanding in his field!",
    "What do you call an alligator wearing a vest? An investigator!",
    "Why did the turkey cross the road? To prove he wasn't chicken!",
    "What do you call a horse that lives next door? A neigh-bor!",
    "Why did the orange stop? It ran out of juice!",
    "What do you call a bear with no teeth? A gummy bear!",
    "Why did the cow go to space? To see the moooon!",
    "What do you call a snobbish criminal going downstairs? A condescending con descending!",
    "Why did the peanut go to the hospital? It was a salted!",
    "What do you call a man with a seagull on his head? Cliff!",
    "Why did the coffee file a police report? It got mugged!",
    "What do you call someone who refuses to fart in public? A private tutor!",
    "Why did the cookie go to the doctor? It felt crummy!",
    "What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks!",
    "Why did the bicycle fall asleep? It was two-tired!",
    "What do you call a T-Rex that's been in a fight? Dino-sore!",
    "Why did the chicken get sent off? Fowl play!",
    "What do you call a train carrying bubble gum? A chew-chew train!",
    "Why did the yogurt go to the museum? It was cultured!",
    "What do you call a line of men waiting for a haircut? A barber-queue!",
    "Why did the hipster burn his tongue? He drank his coffee before it was cool!",
    "What do you call a woman with one leg? Eileen!",
    "Why did the gym close down? It just didn't work out!",
    "What do you call a magic owl? Hoo-dini!",
    "Why did the mushroom go to the party? Because he's a fungi!",
    "What do you call a fish with no eyes? Fsh!",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one!",
    "What do you call an underwater spy? James Pond!",
    "Why did the PowerPoint cross the road? To get to the other slide!",
    "What do you call a Spanish woman who can't find her car? Car-loss!",
    "Why did the duck get arrested? For selling quack!",
    "What do you call a priest that becomes a lawyer? A father-in-law!",
    "Why did the sailor go to school? To improve his navigation!",
    "What do you call a boomerang that doesn't come back? A stick!",
    "Why did the belt go to prison? For holding up a pair of pants!",
    "What do you call a person who's always late? Matt!",
    "Why did the scarecrow get a promotion? He was outstanding in his field!",
    "What do you call a cow with a sense of humor? Laughing stock!",
    "Why did the computer show up at work late? It had a hard drive!",
    "What do you call a bear in the rain? A drizzly bear!",
    "Why did the pony get sent to bed early? He wouldn't stop horsing around!",
    "What do you call a sleeping bag? Nap sack!",
    "Why did the sun go to school? To get brighter!",
    "What do you call a deer with no eyes and no legs? Still no idea!",
    "Why did the tomato blush? It saw the salad dressing!",
    "What do you call cheese that's not yours? Nacho cheese!",
    "Why did the math book visit the psychiatrist? It had too many problems!",
    "What do you call a lazy kangaroo? A pouch potato!",
    "Why did the window go to the doctor? It had pane!",
    "What do you call a snowman with abs? The abdominal snowman!",
    "Why did the teacher wear sunglasses? Because her students were so bright!",
    "What do you call a woman standing in the middle of a tennis court? Annette!",
    "Why did the chicken cross the road? To get to the other side!",
    "What do you call a pony with a sore throat? A little hoarse!",
    "Why did the coffee go to therapy? It had too much pressure!",
    "What do you call a sad cup of coffee? Depresso!",
    "Why did the frog take the bus? His car got toad!",
    "What do you call a dinosaur with an extensive vocabulary? A thesaurus!",
    "Why did the grape stop in the middle of the road? It ran out of juice!",
    "What do you call a pig that does karate? Pork chop!",
    "Why did the crab never share? He was shellfish!",
    "What do you call a factory that makes good products? A satisfactory!",
    "Why did the student study in an airplane? He wanted higher education!",
    "What do you call a medieval knight who's afraid to fight? Sir Render!",
    "Why did the cookie need a doctor? It was feeling crumbly!",
    "What do you call an ant that fights crime? A vigil-ant-e!",
    "Why did the lettuce win the race? It was a-head!",
    "What do you call two monkeys that share an Amazon account? Prime mates!",
    "Why did the banker quit his job? He lost interest!",
    "What do you call a dinosaur fart? A blast from the past!",
    "Why did the scarecrow win employee of the month? He was outstanding in his field!",
    "What do you call a fake noodle? An impasta!",
    "Why did the tree go to the dentist? It needed a root canal!",
    "What do you call a sketchy neighborhood in Italy? The spaghetto!",
    "Why did the stadium get hot? All the fans left!",
    "What do you call a sleeping bull? A bulldozer!",
    "Why did the bicycle keep tipping over? It was two-tired!",
    "What do you call a nervous javelin thrower? Shakespeare!",
    "Why did the computer break up with the internet? There was no connection!",
    "What do you call a bee that can't make up its mind? A maybe!",
    "Why did the duck go to the doctor? He was feeling a little down!",
    "What do you call a shoe made from a banana? A slipper!",
    "Why did the golfer bring an extra pair of socks? In case he got a hole in one!",
    "What do you call an alligator in a vest? An investigator!",
    "Why did the smartphone go to therapy? It had too many issues!",
    "What do you call someone with no nose and no body? Nobody knows!",
    "Why did the coffee taste like mud? It was ground this morning!",
    "What do you call a magical dog? A labracadabrador!",
    "Why did the robot go to the beach? To get rusty!",
    "What do you call a bear with no ears? B!",
    "Why did the orange go to the doctor? It wasn't peeling well!",
    "What do you call a dog that can tell time? A watch dog!",
    "Why did the bread go to therapy? It had too many issues to deal with!",
    "What do you call a potato wearing glasses? A spec-tater!",
    "Why did the skeleton go to prom alone? He had no body to go with!",
    "What do you call a fish wearing a crown? King Neptune!",
    "Why did the belt get locked up? For holding up a pair of pants!",
    "What do you call a cow with no legs? Ground beef!",
    "Why did the calendar go to the doctor? It had a terrible year!",
    "What do you call a sleeping dinosaur? Dino-snore!",
    "Why did the barber win the race? He took a short cut!",
    "What do you call a row of people lifting mozzarella? A cheesy pickup line!",
    "Why did the ocean break up with the pond? Too shallow!",
    "What do you call a group of killer whales playing music? An orca-stra!",
    "Why did the egg refuse to fight? It didn't want to crack under pressure!",
    "What do you call a monkey that sells chips? A chipmunk!",
    "Why did the house go to the doctor? It had window panes!",
    "What do you call an explosive monkey? A baboom!",
    "Why did the banana go to the doctor? It wasn't peeling well!",
    "What do you call a sheep with no legs? A cloud!",
    "Why did the invisible man turn down the job? He couldn't see himself doing it!",
    "What do you call a joke about construction? Still being built!",
    "Why did the chicken join the band? Because it had the drumsticks!",
    "What do you call a fish with two knees? A two-knee fish!",
    "Why did the donut go to the dentist? It needed a filling!",
    "What do you call a funny mountain? Hill-arious!",
    "Why did the clock get kicked out of class? It tocked too much!",
    "What do you call a person lying at your door? Matt!",
    "Why did the duck cross the road? To prove he wasn't chicken!",
    "What do you call a rich elf? Welfy!",
    "Why did the gym cancel? It didn't work out!",
    "What do you call a sleeping pizza? PiZZZa!",
    "Why did the fish blush? Because it saw the ocean's bottom!",
    "What do you call a bear caught in rain? A drizzly bear!",
    "Why did the math teacher break up with the history teacher? There was no chemistry!",
    "What do you call someone who points out the obvious? Someone who points out the obvious!",
    "Why did the student eat his assignment? The teacher said it was a piece of cake!",
    "What do you call a tired pea? A sleepy pea!",
    "Why did the picture go to jail? It was framed!",
    "What do you call an illegally parked frog? Toad!",
    "Why did the mushroom get invited to all the parties? He was a fungi!",
    "What do you call a pile of cats? A meow-tain!",
    "Why did the girl bring a ladder to the concert? She wanted to reach the high notes!",
    "What do you call a psychic midget who escaped from prison? A small medium at large!",
    "Why did the golfer wear two pairs of pants? In case he got a hole in one!",
    "What do you call a parade of rabbits hopping backwards? A receding hare-line!",
    "Why did the smartphone need glasses? It lost all its contacts!",
    "What do you call a cow that plays an instrument? A moo-sician!",
    "Why did the cookie feel sick? It felt crumbly!",
    "What do you call a deer with no eyes? No idea!",
    "Why did the melon jump in the pool? It wanted to be a watermelon!",
    "What do you call a dinosaur that's a noisy sleeper? A Brontosnorus!",
    "Why did the bicycle fall down? It was two-tired!",
    "What do you call a fake stone in Ireland? A sham rock!",
    "Why did the tomato turn red? It saw the salad dressing!",
    "What do you call a dog that does magic? A labracadabrador!",
    "Why did the coffee call 911? It got mugged!",
    "What do you call an owl that does magic tricks? Hoodini!",
    "Why did the golfer bring two pairs of socks? In case he got a hole in one!",
    "What do you call a can opener that doesn't work? A can't opener!",
    "Why did the man fall in the well? He didn't see that well!",
    "What do you call a belt with a watch? A waist of time!",
    "Why did the stadium get so hot after the game? All the fans left!",
    "What do you call a train full of toffee? A chew chew train!",
    "Why did the scarecrow become a therapist? He was outstanding in his field!",
    "What do you call a Mexican who lost his car? Carlos!",
    "Why did the chicken cross the playground? To get to the other slide!",
    "What do you call a woman who's always on time? Dot!",
    "Why did the computer go to the doctor? It had a virus!",
    "What do you call a sheep covered in chocolate? A candy baa!",
    "Why did the baker go to therapy? He kneaded it!",
    "What do you call a boomerang that doesn't come back? A stick!",
    "Why did the orange stop rolling? It ran out of juice!",
    "What do you call a bear with no teeth? A gummy bear!",
    "Why did the toilet paper roll down the hill? To get to the bottom!",
    "What do you call cheese that isn't yours? Nacho cheese!",
    "Why did the astronaut break up? He needed space!",
    "What do you call a fish that wears a bowtie? Sofishticated!",
    "Why did the duck go to rehab? He was a quack addict!",
    "What do you call a sleeping bag? Napsack!",
    "Why did the banana split? It saw the ice cream!",
    "What do you call an elephant that doesn't matter? Irrelephant!",
    "Why did the scarecrow get a medal? For being outstanding in his field!",
    "What do you call a lazy doctor? Dr. Do Little!",
    "Why did the envelope go to the gym? To get first-class male!",
    "What do you call a factory that makes acceptable products? A satisfactory!",
    "Why did the computer sneeze? It had a virus!",
    "What do you call a sleeping dinosaur? A dino-snore!",
    "Why did the bicycle say no? It was two-tired!",
    "What do you call a pig that does karate? A pork chop!",
    "Why did the chicken go to the library? To check out some books!",
    "What do you call a snowman in the summer? A puddle!",
    "Why did the coffee go to the police? It got mugged!",
    "What do you call a pile of kittens? A meow-tain!",
    "Why did the drum go to bed? It was beat!",
    "What do you call a dinosaur with an extensive vocabulary? A thesaurus!",
    "Why did the golfer change his pants? He got a hole in one!",
    "What do you call a very small Valentine? A valen-tiny!",
    "Why did the math book look sad? Because it had too many problems!",
    "What do you call an alligator detective? An investi-gator!",
    "Why did the cookie go to the hospital? Because it felt crummy!",
    "What do you call two monkeys sharing Amazon Prime? Prime mates!",
    "Why did the phone go to the eye doctor? It lost its contacts!",
    "What do you call a fake noodle? An impasta!",
    "Why did the tree go to therapy? It couldn't get over its roots!",
    "What do you call a monkey in a minefield? A baboom!",
    "Why did the window see a therapist? It had too many panes!",
    "What do you call a deer with no eyes and no legs? Still no idea!",
    "Why did the stadium flood? Too many fans!",
    "What do you call birds that stick together? Vel-crows!",
    "Why did the hipster burn his mouth? He ate pizza before it was cool!",
    "What do you call a shoe made of banana? A slipper!",
    "Why did the gym close? It just didn't work out!",
    "What do you call a well-dressed lion? A dandy lion!",
    "Why did the golfer wear an extra pair of pants? In case he got a hole in one!",
    "What do you call a nervous javelin? Shakespeare!",
    "Why did the computer keep freezing? It left its Windows open!",
    "What do you call a cow with a twitch? Beef jerky!",
    "Why did the teddy bear skip dessert? She was stuffed!",
    "What do you call someone who doesn't fart in public? A private tutor!",
    "Why did the pony get detention? For horsing around!",
    "What do you call a group of unorganized cats? A cat-astrophe!",
    "Why did the orange go to the doctor? It wasn't peeling well!",
    "What do you call an apology in morse code? Re-morse code!",
    "Why did the cookie cry? Its mother was a wafer so long!",
    "What do you call a magic dog? A labracadabrador!",
    "Why did the frog call his insurance company? He had a jump in his car!",
    "What do you call a thieving alligator? A crook-o-dile!",
    "Why did the computer go to art class? To learn how to draw!",
    "What do you call a sleeping T-Rex? Dino-snore!",
    "Why did the belt get arrested? For holding up a pair of pants!",
    "What do you call a man with a car on his head? Jack!",
    "Why did the scarecrow win the award? He was outstanding in his field!",
    "What do you call a cow that can play music? A moo-sician!",
    "Why did the baker quit? He couldn't make enough dough!",
    "What do you call a fish without eyes? Fsh!",
    "Why did the bicycle go to therapy? It had too many issues!",
    "What do you call an ant who skips school? A tru-ant!",
    "Why did the grape stop? It ran out of juice!",
    "What do you call a sleeping bull? A bulldozer!",
    "Why did the chicken cross the road twice? To prove he wasn't chicken!",
    "What do you call a bear with no ears? B!",
    "Why did the student bring scissors to class? He wanted to cut class!",
    "What do you call a sad strawberry? A blueberry!",
    "Why did the banana go to the doctor? It wasn't peeling well!",
    "What do you call a dinosaur that crashes cars? Tyrannosaurus Wrecks!",
    "Why did the clock get sent to the principal? It tocked too much!",
    "What do you call a Mexican who lost his car? Car-los!",
    "Why did the tomato blush? Because it saw the salad dressing!",
    "What do you call a zipper on a banana? A fruit fly!",
    "Why did the coffee taste like dirt? It was ground this morning!",
    "What do you call a parade of rabbits walking backwards? A receding hare-line!",
    "Why did the girl smear peanut butter on the road? To go with the traffic jam!",
    "What do you call a train carrying bubble gum? A chew-chew train!",
    "Why did the skeleton go to the party alone? He had no body to go with!",
    "What do you call a fake Irish stone? A sham rock!",
    "Why did the smartphone need glasses? It lost its contacts!",
    "What do you call an illegally parked frog? Toad!",
    "Why did the PowerPoint presentation cross the road? To get to the other slide!",
    "What do you call a row of rabbits hopping backward? A receding hare-line!",
    "Why did the raisin go out with a prune? Because he couldn't get a date!",
    "What do you call a sketchy Italian neighborhood? The spaghetto!",
    "Why did the snail paint an S on his car? So people would say look at that S car go!",
    "What do you call a sleeping pizza? PiZZZa!",
    "Why did the turkey join the band? Because it had the drumsticks!",
    "What do you call a dinosaur with a good vocabulary? A thesaurus!",
    "Why did the man put his money in the freezer? He wanted cold hard cash!",
    "What do you call a cow with no legs? Ground beef!",
    "Why did the golfer bring extra pants? In case he got a hole in one!",
    "What do you call a beautiful pumpkin? Gourd-geous!",
    "Why did the invisible man turn down the job offer? He couldn't see himself doing it!",
    "What do you call a pony with a cough? A little hoarse!",
    "Why did the chicken join a band? It had the drumsticks!",
    "What do you call someone standing in a hole? Phil!",
    "Why did the stadium get hot? All of the fans left!",
    "What do you call a boomerang that doesn't work? A stick!",
    "Why did the picture go to jail? Because it was framed!",
    "What do you call cheese that's not yours? Nacho cheese!",
    "Why did the scarecrow become a successful politician? He was outstanding in his field!",
    "What do you call a priest who becomes a lawyer? A father-in-law!",
    "Why did the coffee file a police report? It got mugged!",
    "What do you call a dog magician? A labracadabrador!",
    "Why did the bicycle fall over? It was two-tired!",
    "What do you call a bear in the rain? A drizzly bear!",
    "Why did the math book see a therapist? It had too many problems!",
    "What do you call an elephant that doesn't matter? Irrelephant!",
    "Why did the orange stop? It ran out of juice!",
    "What do you call a fake noodle? An impasta!",
    "Why did the tomato turn red? It saw the salad dressing!",
    "What do you call a sleeping dinosaur? A dino-snore!",
    "Why did the gym close down? It just didn't work out!",
    "What do you call a deer with no eyes? No eye-deer!",
    "Why did the cookie go to the doctor? Because it felt crumbly!",
    "What do you call a pile of cats? A meow-tain!",
    "Why did the belt go to jail? For holding up a pair of pants!",
    "What do you call a Spanish guy who lost his car? Carlos!",
    "Why did the frog take the bus? His car got toad away!",
    "What do you call a bee that can't decide? A maybe!",
    "Why did the computer go to the doctor? It had a virus!",
    "What do you call a sleeping bull? A bulldozer!",
    "Why did the golfer change socks? He got a hole in one!",
    "What do you call an alligator in a vest? An investigator!",
    "Why did the calendar go to therapy? Its days were numbered!",
    "What do you call an underwater spy? James Pond!",
    "Why did the lettuce win the race? It was a head!",
    "What do you call a group of killer whales? An orca-stra!",
    "Why did the phone wear glasses? It lost its contacts!",
    "What do you call a broken can opener? A can't opener!",
    "Why did the chicken cross the playground? To get to the other slide!",
    "What do you call a factory that makes satisfactory products? A satisfactory!",
    "Why did the mushroom go to the party? He was a fungi!",
    "What do you call a lazy kangaroo? A pouch potato!",
    "Why did the banana go to the doctor? It wasn't peeling well!",
    "What do you call a cow that plays instruments? A moo-sician!",
    "Why did the teddy bear say no to dessert? Because she was stuffed!",
    "What do you call a nosy pepper? Jalapeño business!",
    "Why did the balloon go near the needle? To be a pop star!",
    "What do you call a dinosaur that never gives up? Try-ceratops!",
    "Why did the donut go to the dentist? It needed a filling!",
    "What do you call a well-balanced horse? Stable!",
    "Why did the plant go to therapy? It had deep-rooted issues!",
    "What do you call a running turkey? Fast food!",
    "Why did the drum take a nap? It was beat!",
    "What do you call a sad coffee? Depresso!",
    "Why did the rope go to school? To get more knowledge knots!",
    "What do you call a happy cowboy? A jolly rancher!",
    "Why did the laptop go to the chiropractor? It had a slipped disk!",
    "What do you call two monkeys sharing Amazon? Prime mates!",
    "Why did the golfer bring two pairs of shoes? In case he got a hole in one!",
    "What do you call a nervous javelin thrower? Shakespeare!",
    "Why did the chicken cross the Mobius strip? To get to the same side!",
    "What do you call a monkey in a minefield? A baboom!",
    "Why did the stadium flood? The fans went wild!",
    "What do you call an acid with attitude? A-mean-o acid!",
    "Why did the M&M go to school? To become a Smartie!",
    "What do you call a fly with no wings? A walk!",
    "Why did the tree go to the dentist? It needed a root canal!",
    "What do you call a thieving alligator? A crook-odile!",
    "Why did the donut go to therapy? It was feeling glazed and confused!",
    "What do you call an attractive volcano? Lava-ly!",
    "Why did the smartphone go to the eye doctor? It lost its contacts!",
    "What do you call a rabbit comedian? A funny bunny!",
    "Why did the man put his car in the oven? He wanted a hot rod!",
    "What do you call a medieval soldier who survived? A sur-vivor!",
    "Why did the old man fall in the well? He couldn't see that well!",
    "What do you call a pile of puppies? A litter!",
    "Why did the computer get cold? It left its Windows open!",
    "What do you call a stolen Tesla? An Edison!",
    "Why did the turkey cross the road? To prove he wasn't chicken!",
    "What do you call a horse that lives next door? A neigh-bor!",
    "Why did the cow go to outer space? To visit the moooon!",
    "What do you call a snobbish criminal descending stairs? A condescending con descending!",
    "Why did the peanut go to the hospital? Because it was a-salted!",
    "What do you call someone who won't fart in public? A private tutor!",
    "Why did the belt get locked up? For holding up pants!",
    "What do you call a T-Rex in a fight? Dino-sore!",
    "Why did the yogurt go to the art exhibit? Because it was cultured!",
    "What do you call a line of men waiting for haircuts? A barber-queue!",
    "Why did the hipster burn his tongue? He drank coffee before it was cool!",
    "What do you call a magic owl? Hoo-dini!",
    "Why did the PowerPoint cross the road? To get to the other slide!",
    "What do you call a duck that gets straight A's? A wise quacker!",
    "Why did the sailor go to school? To improve his navigation!",
    "What do you call a person who's always late to everything? Matt!",
    "Why did the computer show up late? It had a hard drive!",
    "What do you call a cow with humor? Laughing stock!",
    "Why did the window go to the doctor? It had window panes!",
    "What do you call a deer with no eyes or legs? Still no idea!",
    "Why did the teacher wear sunglasses? Her students were too bright!",
    "What do you call a woman in the middle of a tennis court? Annette!",
    "Why did the grape stop in the road? It ran out of juice!",
    "What do you call a medieval knight who's scared? Sir Render!",
    "Why did the crab never share? Because he was shellfish!",
    "What do you call a dinosaur fart? A blast from the past!",
    "Why did the tree need therapy? It had too many issues with its roots!",
    "What do you call a boomerang that won't return? A stick!",
    "Why did the computer break up with the internet? No connection!",
    "What do you call a bee that can't decide? A maybe!",
    "Why did the duck see a doctor? It was feeling down!",
    "What do you call a potato with glasses? A spec-tater!",
    "Why did the bread go to therapy? Too many issues!",
    "What do you call a fish with a crown? King Neptune!",
    "Why did the ocean dump the pond? Too shallow!",
    "What do you call an explosive monkey? A baboom!",
    "Why did the egg refuse to fight? Didn't want to crack under pressure!",
    "What do you call a joke under construction? Still being built!",
    "Why did the clock get detention? It tocked in class!",
    "What do you call a rich elf? Welfy!",
    "Why did the fish get embarrassed? It saw the ocean's bottom!",
    "What do you call someone who states the obvious? Someone who states the obvious!",
    "Why did the math teacher dump the history teacher? No chemistry!",
    "What do you call a tired pea? A sleepy pea!",
    "Why did the mushroom get invited everywhere? He was a fungi!",
    "What do you call a psychic midget who escaped jail? A small medium at large!",
    "Why did the girl bring a ladder to the concert? To hit the high notes!",
    "What do you call a dinosaur that's a noisy sleeper? A Bronto-snorus!",
    "Why did the melon jump in the lake? To become a watermelon!",
    "What do you call a woman who's always punctual? Dot!",
    "Why did the baker need therapy? He kneaded it!",
    "What do you call a lazy doctor? Dr. Do-Little!",
    "Why did the envelope hit the gym? To get first-class male!",
    "What do you call a well-dressed lion? A dandy-lion!",
    "Why did the teddy bear skip dessert? She was stuffed!",
    "What do you call an ant who skips school? A tru-ant!",
    "Why did the student bring scissors? To cut class!",
    "What do you call a man with a car on his head? Jack!",
    "Why did the bicycle need therapy? Too many issues!",
    "What do you call a zipper on a banana? A fruit fly!",
    "Why did the girl put peanut butter on the road? For the traffic jam!",
    "What do you call someone standing in a hole? Phil!",
    "Why did the snail paint S on his car? So people'd say look at that S-car-go!",
    "What do you call a sleeping bag? Nap sack!",
    "Why did the man freeze his money? He wanted cold hard cash!",
    "What do you call a beautiful pumpkin? Gourd-geous!",
    "Why did the scarecrow become a politician? He was outstanding in his field!",
    "What do you call a dog that tells time? A watch dog!",
    "Why did the robot visit the beach? To get rusty!",
    "What do you call a train with bubble gum? A chew-chew train!",
    "Why did the chicken visit the library? To check out books!",
    "What do you call a snowman in summer? A puddle!",
    "Why did the drum sleep? It was beat!",
    "What do you call a very small Valentine? A valen-tiny!",
    "Why did the tree see a therapist? Couldn't get over its roots!",
    "What do you call birds that stick together? Vel-crows!",
    "Why did the hipster burn his mouth on pizza? He ate it before it was cool!",
    "What do you call a group of disorganized cats? A cat-astrophe!",
    "Why did the pony get sent to bed? He wouldn't stop horsing around!",
    "What do you call an apology in morse code? Re-morse code!",
    "Why did the cookie cry? His mother was a wafer so long!",
    "What do you call a magic dog? A labracadabrador!",
    "Why did the frog call insurance? He had a jump in his car!",
    "What do you call a thief alligator? A crook-o-dile!",
    "Why did the computer take art class? To learn to draw!",
    "What do you call a cow with a twitch? Beef jerky!",
    "Why did the grape stop moving? Ran out of juice!",
    "What do you call a train full of toffee? A chew-chew train!",
    "Why did the raisin date a prune? He couldn't get a date!",
    "What do you call a sketchy Italian area? The spaghetto!",
    "Why did the turkey join a band? It had the drumsticks!",
    "What do you call someone in a hole? Doug!",
    "Why did the chicken cross twice? To prove he wasn't chicken!",
    "What do you call a priest who's a lawyer? A father-in-law!",
    "Why did the coffee go to police? It got mugged!",
    "What do you call a dog magician? A labracadabrador!",
    "Why did the golfer wear extra pants? In case of a hole in one!",
    "What do you call a Spanish woman without a car? Car-loss!",
    "Why did the calendar see a therapist? Its days were numbered!"
  ]
}
