[
  "Q: Why did the tree go to the dentist?\nA: It needed a root canal!",
  "Q: What do you call a horse that moves around a lot?\nA: Unstable!",
  "Q: Why did the duck fail his driving test?\nA: He kept quacking under pressure!",
  "Q: What do you call a sad coffee?\nA: Depresso!",
  "Q: Why did the envelope go to therapy?\nA: It couldn't deal with being sealed off!",
  "Q: What do you call a potato that's watching a football game?\nA: A spec-tater!",
  "Q: Why did the cloud break up with the sun?\nA: It was tired of being evaporated!",
  "Q: What do you call a cow with a sense of humor?\nA: Laughing stock!",
  "Q: Why did the phone go to art school?\nA: It wanted to learn how to draw!",
  "Q: What do you call a group of musical whales?\nA: An orca-stra!",
  "Q: Why did the broom get a raise?\nA: It was sweeping the competition!",
  "Q: What do you call a thieving alligator?\nA: A crook-odile!",
  "Q: Why did the restaurant hire the pig?\nA: He was great at bacon people happy!",
  "Q: What do you call a cold dog?\nA: A chili dog!",
  "Q: Why did the orange stop?\nA: It ran out of juice!",
  "Q: What do you call a sleeping bag for babies?\nA: A nap-sack!",
  "Q: Why did the laptop go to the doctor?\nA: It had a virus!",
  "Q: What do you call a dinosaur with an extensive vocabulary?\nA: A thesaurus!",
  "Q: Why did the football coach go to the bank?\nA: To get his quarterback!",
  "Q: What do you call a sheep with no legs?\nA: A cloud!",
  "Q: Why did the banana fail the exam?\nA: It couldn't find the answer, it split!",
  "Q: What do you call a dog on the beach in summer?\nA: A hot dog!",
  "Q: Why did the egg hide?\nA: It was a little chicken!",
  "Q: What do you call a grumpy cow?\nA: Moo-dy!",
  "Q: Why did the fish blush?\nA: Because it saw the ocean's bottom!",
  "Q: What do you call a fake noodle?\nA: An impasta!",
  "Q: Why did the scarecrow win an award?\nA: He was outstanding in his field!",
  "Q: What do you call a bee having a bad hair day?\nA: A frisbee!",
  "Q: Why did the math book look sad?\nA: Because it had too many problems!",
  "Q: What do you call a sleeping bull?\nA: A bulldozer!",
  "Q: Why did the cookie go to the doctor?\nA: It felt crumbly!",
  "Q: What do you call a dinosaur that never gives up?\nA: Try-try-try-ceratops!",
  "Q: Why did the calendar get arrested?\nA: Its days were numbered!",
  "Q: What do you call a pile of kittens?\nA: A meow-tain!",
  "Q: Why did the bicycle need therapy?\nA: It was two tired of cycling!",
  "Q: What do you call an alligator in a vest?\nA: An investigator!",
  "Q: Why did the tomato turn red?\nA: It saw the salad dressing!",
  "Q: What do you call a bear in the rain?\nA: A drizzly bear!",
  "Q: Why did the belt go to jail?\nA: It was holding up a pair of pants!",
  "Q: What do you call cheese that isn't yours?\nA: Nacho cheese!",
  "Q: Why did the stadium get hot?\nA: All the fans left!",
  "Q: What do you call a sleeping dinosaur?\nA: A dino-snore!",
  "Q: Why did the lamp go to school?\nA: To get brighter!",
  "Q: What do you call a snowman with a six-pack?\nA: An abdominal snowman!",
  "Q: Why did the computer catch a cold?\nA: It left its Windows open!",
  "Q: What do you call a fish with no eyes?\nA: Fsh!",
  "Q: Why did the skeleton go to the party alone?\nA: He had nobody to go with!",
  "Q: What do you call a line of rabbits walking backward?\nA: A receding hare-line!",
  "Q: Why did the golfer bring two pairs of pants?\nA: In case he got a hole in one!",
  "Q: What do you call a sleeping pizza?\nA: A piZZZa!",
  "Q: Why did the pencil go to therapy?\nA: It had too many issues to erase!",
  "Q: What do you call a vegetable that's cool?\nA: A rad-ish!",
  "Q: Why did the baker stop making donuts?\nA: He was tired of the hole business!",
  "Q: What do you call a nervous zucchini?\nA: An anxious squash!",
  "Q: Why did the shoe go to therapy?\nA: It had a sole-searching crisis!",
  "Q: What do you call a train carrying bubblegum?\nA: A chew-chew train!",
  "Q: Why did the chicken join a band?\nA: Because it had drumsticks!",
  "Q: What do you call a deer with no eyes?\nA: No idea!",
  "Q: Why did the mushroom go to the party?\nA: He was a fungi!",
  "Q: What do you call a fly without wings?\nA: A walk!",
  "Q: Why did the yogurt go to the museum?\nA: Because it was cultured!",
  "Q: What do you call a boomerang that doesn't return?\nA: A stick!",
  "Q: Why did the scarecrow become successful?\nA: He was outstanding in his field!",
  "Q: What do you call a fake stone in Ireland?\nA: A sham-rock!",
  "Q: Why did the melon jump in the lake?\nA: It wanted to be a watermelon!",
  "Q: What do you call a cow with two legs?\nA: Lean beef!",
  "Q: Why did the paper go to the doctor?\nA: It was feeling a little stationary!",
  "Q: What do you call an elephant that doesn't matter?\nA: Irrelephant!",
  "Q: Why did the orange go to the doctor?\nA: It wasn't peeling well!",
  "Q: What do you call a magic dog?\nA: A labracadabrador!",
  "Q: Why did the can crusher quit?\nA: Because it was soda pressing!",
  "Q: What do you call a pile of cats?\nA: A meow-ntain!",
  "Q: Why did the tree need to take a nap?\nA: For rest!",
  "Q: What do you call a nervous wreck driving a car?\nA: A brake-down!",
  "Q: Why did the boy bring a ladder to school?\nA: He wanted to go to high school!",
  "Q: What do you call a singing laptop?\nA: A Dell!",
  "Q: Why did the egg go to therapy?\nA: It couldn't get out of its shell!",
  "Q: What do you call a cow eating grass?\nA: A lawn moo-er!",
  "Q: Why did the banana go to the doctor?\nA: It wasn't peeling well!",
  "Q: What do you call a wolf in sheep's clothing?\nA: An impaws-ter!",
  "Q: Why did the gardener plant a seed in the pond?\nA: To grow a water-melon!",
  "Q: What do you call a shoe made from a banana?\nA: A slipper!",
  "Q: Why did the traffic light turn red?\nA: You would too if you had to change in public!",
  "Q: What do you call a well-dressed lion?\nA: A dandy-lion!",
  "Q: Why did the vacuum go to therapy?\nA: It was tired of people's dirt!",
  "Q: What do you call a retired vegetable?\nA: A has-bean!",
  "Q: Why did the cookie cry?\nA: Because its mother was a wafer so long!",
  "Q: What do you call a fish wearing a crown?\nA: Your royal high-ness!",
  "Q: Why did the donut go to the dentist?\nA: It needed a filling!",
  "Q: What do you call a pig doing karate?\nA: Pork chop!",
  "Q: Why did the clock get kicked out of school?\nA: It tocked too much!",
  "Q: What do you call a monkey in a minefield?\nA: A baboom!",
  "Q: Why did the gym close?\nA: It didn't work out!",
  "Q: What do you call a lazy kangaroo?\nA: A pouch potato!",
  "Q: Why did the toilet paper roll down the hill?\nA: To get to the bottom!",
  "Q: What do you call a sleeping forest?\nA: A lumber yard!",
  "Q: Why did the plant go to the doctor?\nA: It had growing pains!",
  "Q: What do you call a cow during an earthquake?\nA: A milkshake!"
]
