[
  "Q: Why did the sun go to school?\nA: To get brighter!",
  "Q: What do you call a fish without eyes?\nA: Fsh!",
  "Q: Why did the melon jump into the pool?\nA: It wanted to be a watermelon!",
  "Q: What do you call a sleeping bag?\nA: A nap sack!",
  "Q: Why did the chicken join a band?\nA: It had the drumsticks!",
  "Q: What do you call a shoe made from a banana?\nA: A slipper!",
  "Q: Why did the envelope cry?\nA: It got sealed!",
  "Q: What do you call a religious bug?\nA: A mosque-ito!",
  "Q: Why did the picture go to jail?\nA: It was framed!",
  "Q: What do you call a dinosaur that's sleeping?\nA: A dino-snore!",
  "Q: Why did the scarecrow get promoted?\nA: He was outstanding in his field!",
  "Q: What do you call a grumpy cow?\nA: Moo-dy!",
  "Q: Why did the broom get a promotion?\nA: It was sweeping the nation!",
  "Q: What do you call a well-dressed lion?\nA: A dandy-lion!",
  "Q: Why did the quarter not roll down the hill with the nickel?\nA: It had more cents!",
  "Q: What do you call a sleeping dog?\nA: A hush puppy!",
  "Q: Why did the kid bring a ladder to school?\nA: He wanted to go to high school!",
  "Q: What do you call an anxious dinosaur?\nA: A nervous Rex!",
  "Q: Why did the apple watch go to therapy?\nA: It had too much time on its hands!",
  "Q: What do you call a cow with two legs?\nA: Lean beef!",
  "Q: Why did the banana go to the doctor?\nA: It wasn't peeling well!",
  "Q: What do you call a psychic midget?\nA: A small medium at large!",
  "Q: Why did the donut go to therapy?\nA: It had a hole in its heart!",
  "Q: What do you call a T-rex that loves Mexican food?\nA: Tyrannosaurus Mex!",
  "Q: Why did the baker stop making donuts?\nA: He was tired of the hole business!",
  "Q: What do you call a dog that does magic?\nA: A labracadabrador!",
  "Q: Why did the calendar go to therapy?\nA: Its days were numbered!",
  "Q: What do you call a fake pasta?\nA: An impasta!",
  "Q: Why did the mushroom go to the party?\nA: He was a fungi!",
  "Q: What do you call a bear without teeth?\nA: A gummy bear!",
  "Q: Why did the bicycle need a nap?\nA: It was two tired!",
  "Q: What do you call a pile of kittens?\nA: A meow-tain!",
  "Q: Why did the crab never share?\nA: It was shellfish!",
  "Q: What do you call a train with a cold?\nA: Achoo-choo train!",
  "Q: Why did the computer go to the doctor?\nA: It had a virus!",
  "Q: What do you call cheese that isn't yours?\nA: Nacho cheese!",
  "Q: Why did the belt get arrested?\nA: It was holding up pants!",
  "Q: What do you call an alligator detective?\nA: An investi-gator!",
  "Q: Why did the scarecrow win an award?\nA: He was outstanding in his field!",
  "Q: What do you call a sheep with no legs?\nA: A cloud!",
  "Q: Why did the math book look sad?\nA: It had too many problems!",
  "Q: What do you call a boomerang that doesn't work?\nA: A stick!",
  "Q: Why did the skeleton go to the party alone?\nA: He had no body!",
  "Q: What do you call a sleeping bull?\nA: A bulldozer!",
  "Q: Why did the tomato turn red?\nA: It saw the salad dressing!",
  "Q: What do you call a fish wearing a crown?\nA: King Neptune!",
  "Q: Why did the cookie go to the doctor?\nA: It felt crumbly!",
  "Q: What do you call a nervous javelin?\nA: Shakespeare!",
  "Q: Why did the orange stop?\nA: It ran out of juice!",
  "Q: What do you call a sleeping forest?\nA: A lumber yard!",
  "Q: Why did the clock go to the principal's office?\nA: It tocked too much!",
  "Q: What do you call a polar bear in Florida?\nA: Lost!",
  "Q: Why did the golfer bring two pairs of pants?\nA: In case he got a hole in one!",
  "Q: What do you call a sad cup of coffee?\nA: A depresso!",
  "Q: Why did the phone need glasses?\nA: It lost its contacts!",
  "Q: What do you call a dinosaur with extensive vocabulary?\nA: A thesaurus!",
  "Q: Why did the student eat his homework?\nA: The teacher said it was a piece of cake!",
  "Q: What do you call a dancing sheep?\nA: A baaaah-llerina!",
  "Q: Why did the toilet paper roll down the hill?\nA: To get to the bottom!",
  "Q: What do you call a monkey in a minefield?\nA: A baboom!",
  "Q: Why did the tree need to take a nap?\nA: For rest!",
  "Q: What do you call an elephant that doesn't matter?\nA: Irrelephant!",
  "Q: Why did the gym close down?\nA: It didn't work out!",
  "Q: What do you call a fake Irish stone?\nA: A sham-rock!",
  "Q: Why did the scarecrow become a motivational speaker?\nA: He was outstanding in his field!",
  "Q: What do you call a thieving alligator?\nA: A crook-odile!",
  "Q: Why did the banana split?\nA: It saw the ice cream!",
  "Q: What do you call a retired vegetable?\nA: A has-bean!",
  "Q: Why did the pencil go to school?\nA: To get sharper!",
  "Q: What do you call a cow during an earthquake?\nA: A milkshake!",
  "Q: Why did the stadium get hot?\nA: All the fans left!",
  "Q: What do you call a sleeping pizza?\nA: A piZZZa!",
  "Q: Why did the vacuum cleaner quit?\nA: It was tired of being pushed around!",
  "Q: What do you call a vegetable that's cool?\nA: A rad-ish!",
  "Q: Why did the yogurt go to the art museum?\nA: It was cultured!",
  "Q: What do you call a lazy kangaroo?\nA: A pouch potato!",
  "Q: Why did the bee have sticky hair?\nA: It used a honeycomb!",
  "Q: What do you call a wolf in sheep's clothing?\nA: An impaws-ter!",
  "Q: Why did the belt go to therapy?\nA: It felt strapped!",
  "Q: What do you call a haunted chicken?\nA: A poultry-geist!",
  "Q: Why did the computer catch a cold?\nA: It left its Windows open!",
  "Q: What do you call a mountain that tells jokes?\nA: Hill-arious!",
  "Q: Why did the egg hide?\nA: It was a little chicken!",
  "Q: What do you call a line of rabbits hopping backwards?\nA: A receding hareline!",
  "Q: Why did the can crusher quit?\nA: It was soda pressing!",
  "Q: What do you call a fish with no eyes?\nA: Fsh!",
  "Q: Why did the book join the police?\nA: It wanted to go undercover!",
  "Q: What do you call a deer with no eyes?\nA: No eye-deer!",
  "Q: Why did the lettuce win the race?\nA: It was a head!",
  "Q: What do you call a happy cowboy?\nA: A jolly rancher!",
  "Q: Why did the chicken cross the playground?\nA: To get to the other slide!",
  "Q: What do you call a frozen dog?\nA: A pupsicle!",
  "Q: Why did the cloud become a therapist?\nA: It was good at reigning in emotions!",
  "Q: What do you call a snowman with abs?\nA: An abdominal snowman!",
  "Q: Why did the astronaut break up with his girlfriend?\nA: He needed space!",
  "Q: What do you call a group of musical whales?\nA: An orca-stra!"
]
