[
  "Q: Why don't scientists trust atoms?\nA: Because they make up everything!",
  "Q: What do you call a factory that makes okay products?\nA: A satisfactory!",
  "Q: Why did the scarecrow win an award?\nA: He was outstanding in his field!",
  "Q: What do you call a belt made of watches?\nA: A waist of time!",
  "Q: What do you call cheese that isn't yours?\nA: Nacho cheese!",
  "Q: Why did the bicycle fall over?\nA: It was two tired!",
  "Q: How do you organize a space party?\nA: You planet!",
  "Q: What's orange and sounds like a parrot?\nA: A carrot!",
  "Q: Why can't your nose be 12 inches long?\nA: Because then it would be a foot!",
  "Q: What do you call a fake noodle?\nA: An impasta!",
  "Q: Why did the coffee file a police report?\nA: It got mugged!",
  "Q: What do you call a bear with no teeth?\nA: A gummy bear!",
  "Q: How does a penguin build its house?\nA: Igloos it together!",
  "Q: Why don't skeletons fight each other?\nA: They don't have the guts!",
  "Q: Why did the math book look sad?\nA: It had too many problems!",
  "Q: What do you call a sleeping bull?\nA: A bulldozer!",
  "Q: How do you make a tissue dance?\nA: You put a little boogie in it!",
  "Q: What's the best time to go to the dentist?\nA: Tooth-hurty!",
  "Q: Why did the golfer bring two pairs of pants?\nA: In case he got a hole in one!",
  "Q: What do you call a fish wearing a bowtie?\nA: Sofishticated!",
  "Q: Why couldn't the leopard play hide and seek?\nA: Because he was always spotted!",
  "Q: What do you call an alligator in a vest?\nA: An investigator!",
  "Q: How do you catch a squirrel?\nA: Climb a tree and act like a nut!",
  "Q: Why did the tomato turn red?\nA: Because it saw the salad dressing!",
  "Q: What do you call a pile of cats?\nA: A meowtain!",
  "Q: Why don't oysters donate to charity?\nA: Because they're shellfish!",
  "Q: What did the grape do when he got stepped on?\nA: He let out a little wine!",
  "Q: Why did the cookie go to the doctor?\nA: Because it felt crumbly!",
  "Q: What do you call a dinosaur that crashes his car?\nA: Tyrannosaurus Wrecks!",
  "Q: What do you call a snowman with a six-pack?\nA: An abdominal snowman!",
  "Q: Why did the stadium get hot after the game?\nA: All the fans left!",
  "Q: What do you call a boomerang that won't come back?\nA: A stick!",
  "Q: Why don't scientists trust stairs?\nA: Because they're always up to something!",
  "Q: What did the janitor say when he jumped out of the closet?\nA: Supplies!",
  "Q: Why did the yogurt go to the art museum?\nA: Because it was cultured!",
  "Q: What do you call a can opener that doesn't work?\nA: A can't opener!",
  "Q: Why did the computer go to the doctor?\nA: It had a virus!",
  "Q: What do you call a magic dog?\nA: A labracadabrador!",
  "Q: Why don't seagulls fly over the bay?\nA: Because then they'd be bagels!",
  "Q: What did one wall say to the other wall?\nA: I'll meet you at the corner!",
  "Q: Why did the picture go to jail?\nA: Because it was framed!",
  "Q: What do you call a shoe made of a banana?\nA: A slipper!",
  "Q: Why did the chicken join a band?\nA: Because it had the drumsticks!",
  "Q: What do you call a cow with no legs?\nA: Ground beef!",
  "Q: Why did the student eat his homework?\nA: The teacher said it was a piece of cake!",
  "Q: What do you call a sleeping dinosaur?\nA: A dino-snore!",
  "Q: Why did the bicycle need a nap?\nA: It was two tired!",
  "Q: What do you call a group of musical whales?\nA: An orca-stra!",
  "Q: Why did the moon skip dinner?\nA: Because it was full!",
  "Q: What do you call a pig that does karate?\nA: A pork chop!",
  "Q: Why did the banana go to the doctor?\nA: It wasn't peeling well!",
  "Q: What do you call a bear in the rain?\nA: A drizzly bear!",
  "Q: Why did the mushroom go to the party?\nA: Because he was a fungi!",
  "Q: What do you call a fish with no eyes?\nA: Fsh!",
  "Q: Why did the clock get in trouble?\nA: It tocked too much!",
  "Q: What do you call a lazy kangaroo?\nA: A pouch potato!",
  "Q: Why did the pencil go to therapy?\nA: It had too many issues to erase!",
  "Q: What do you call a vegetable that's cool?\nA: A rad-ish!",
  "Q: Why did the cookie cry?\nA: Because its mom was a wafer so long!",
  "Q: What do you call a monkey in a minefield?\nA: A baboom!",
  "Q: Why did the belt go to jail?\nA: For holding up a pair of pants!",
  "Q: What do you call a snowman in July?\nA: A puddle!",
  "Q: Why did the baker go to therapy?\nA: He kneaded someone to talk to!",
  "Q: What do you call a detective alligator?\nA: An investi-gator!",
  "Q: Why did the tree need to take a nap?\nA: For rest!",
  "Q: What do you call a sleeping bag?\nA: A nap sack!",
  "Q: Why did the orange stop rolling?\nA: It ran out of juice!",
  "Q: What do you call a pile of kittens?\nA: A meow-tain!",
  "Q: Why did the smartphone need glasses?\nA: It lost all its contacts!",
  "Q: What do you call a religious insect?\nA: A mosque-ito!",
  "Q: Why did the piano break up with the accordion?\nA: It found a better key!",
  "Q: What do you call a train that sneezes?\nA: Achoo-choo train!",
  "Q: Why did the drum go to the doctor?\nA: It was feeling a little beat!",
  "Q: What do you call a sad coffee?\nA: A depresso!",
  "Q: Why did the computer get cold?\nA: It left its Windows open!",
  "Q: What do you call a bee that can't decide?\nA: A maybe!",
  "Q: Why did the lamp go to school?\nA: To get brighter!",
  "Q: What do you call a nervous javelin?\nA: Shakespeare!",
  "Q: Why did the broom get promoted?\nA: It was sweeping the competition!",
  "Q: What do you call a frozen dog?\nA: A pupsicle!",
  "Q: Why did the vacuum cleaner break up?\nA: The relationship sucked!",
  "Q: What do you call a happy cowboy?\nA: A jolly rancher!",
  "Q: Why did the calendar get arrested?\nA: Its days were numbered!",
  "Q: What do you call bread that tells jokes?\nA: A pun-cake!",
  "Q: Why did the gym close down?\nA: It didn't work out!",
  "Q: What do you call a psychic little person?\nA: A small medium at large!",
  "Q: Why did the rope go to school?\nA: To get tied up in learning!",
  "Q: What do you call a wealthy elf?\nA: Welfy!",
  "Q: Why did the cloud become a therapist?\nA: It was good at reigning in emotions!",
  "Q: What do you call a fake stone?\nA: A sham-rock!",
  "Q: Why did the football coach go to the bank?\nA: To get his quarterback!",
  "Q: What do you call a deer with no eyes?\nA: No eye-deer!",
  "Q: Why did the skeleton go to prom alone?\nA: He had no body to go with!",
  "Q: What do you call a laughing motorcycle?\nA: A Yamahahaha!",
  "Q: Why did the tea bag stay home?\nA: It was feeling steeped in sadness!",
  "Q: What do you call a singing laptop?\nA: A Dell!",
  "Q: Why did the book join the police?\nA: It wanted to go undercover!",
  "Q: What do you call an elephant that doesn't matter?\nA: Irrelephant!",
  "Q: Why did the sock go to therapy?\nA: It had a hole in its sole!"
]
