[
  "Q: Why do cows wear bells?\nA: Because their horns don't work!",
  "Q: What do you call a dinosaur with an extensive vocabulary?\nA: A thesaurus!",
  "Q: Why did the math teacher open a bakery?\nA: Because she knew how to make pi!",
  "Q: What do you call a parade of rabbits hopping backwards?\nA: A receding hare-line!",
  "Q: Why did the scarecrow become a successful businessman?\nA: He was outstanding in his field!",
  "Q: What do you call a can of soda with a college degree?\nA: A graduated cylinder!",
  "Q: Why did the gym teacher marry the science teacher?\nA: They had great chemistry!",
  "Q: What do you call a nervous zucchini?\nA: An anxious squash!",
  "Q: Why did the photographer go to prison?\nA: He got caught shooting people!",
  "Q: What do you call a dog magician?\nA: A labracadabrador!",
  "Q: Why did the invisible man turn down the job offer?\nA: He couldn't see himself doing it!",
  "Q: What do you call a sketchy neighborhood in Italy?\nA: The spaghetto!",
  "Q: Why did the golfer bring an extra pair of socks?\nA: In case he got a hole in one!",
  "Q: What do you call a belt with a watch on it?\nA: A waist of time!",
  "Q: Why did the scarecrow win the Nobel Prize?\nA: For being out-standing in his field!",
  "Q: What do you call a group of disorganized cats?\nA: A cat-astrophe!",
  "Q: Why did the bicycle go to therapy?\nA: It couldn't handle the cycle!",
  "Q: What do you call a fake Irish stone?\nA: A shamrock!",
  "Q: Why did the duck get kicked out of the library?\nA: It wouldn't stop quacking jokes!",
  "Q: What do you call a lion who's eaten your mother and father?\nA: An orphan-maker!",
  "Q: Why did the musician get locked out?\nA: He had the wrong key!",
  "Q: What do you call a retired vegetable?\nA: A has-bean!",
  "Q: Why did the egg hide?\nA: It was a little chicken!",
  "Q: What do you call a dinosaur that never gives up?\nA: Try-try-triceratops!",
  "Q: Why did the restaurant hire a pig?\nA: He was great at bacon!",
  "Q: What do you call a bee from America?\nA: A USB!",
  "Q: Why did the banana put on sunscreen?\nA: Because it was starting to peel!",
  "Q: What do you call a sleeping pizza?\nA: A piZZZa!",
  "Q: Why did the apple watch go to therapy?\nA: It had too much time on its hands!",
  "Q: What do you call a sad strawberry?\nA: A blue-berry!",
  "Q: Why did the light bulb fail school?\nA: It wasn't too bright!",
  "Q: What do you call a dancing sheep?\nA: A baaah-llerina!",
  "Q: Why did the boat go to the doctor?\nA: It was feeling a little dinghy!",
  "Q: What do you call a mountain that tells jokes?\nA: Hill-arious!",
  "Q: Why did the battery go to the doctor?\nA: It wasn't holding a charge!",
  "Q: What do you call cheese that's not yours?\nA: Nacho cheese!",
  "Q: Why did the phone wear glasses?\nA: It lost its contacts!",
  "Q: What do you call a cow during an earthquake?\nA: A milkshake!",
  "Q: Why did the lettuce win the race?\nA: It was ahead!",
  "Q: What do you call a kangaroo who lifts weights?\nA: Jacked-aroo!",
  "Q: Why did the donut go to the dentist?\nA: It needed a filling!",
  "Q: What do you call a pig that knows karate?\nA: Pork chop!",
  "Q: Why did the bee have sticky hair?\nA: It used a honeycomb!",
  "Q: What do you call a sheep with no legs?\nA: A cloud!",
  "Q: Why did the toilet paper roll down the hill?\nA: To get to the bottom!",
  "Q: What do you call a knight who's afraid to fight?\nA: Sir Render!",
  "Q: Why did the cookie visit the doctor?\nA: It was feeling crumbly!",
  "Q: What do you call a line of rabbits walking backward?\nA: A receding hareline!",
  "Q: Why did the sun go to school?\nA: To get brighter!",
  "Q: What do you call a thieving alligator?\nA: A crook-odile!",
  "Q: Why did the chicken go to the séance?\nA: To talk to the other side!",
  "Q: What do you call a grumpy cow?\nA: Moo-dy!",
  "Q: Why did the skeleton go to the party alone?\nA: He had no-body to go with!",
  "Q: What do you call a famous fish?\nA: A starfish!",
  "Q: Why did the plant go to the doctor?\nA: It had growing pains!",
  "Q: What do you call a boomerang that doesn't come back?\nA: A stick!",
  "Q: Why did the teacher wear sunglasses to class?\nA: Her students were so bright!",
  "Q: What do you call a well-behaved dog?\nA: A good boy!",
  "Q: Why did the banana split?\nA: Because it saw the ice cream!",
  "Q: What do you call an illegally parked frog?\nA: Toad!",
  "Q: Why did the number six hate the number seven?\nA: Because seven eight nine!",
  "Q: What do you call a wolf in sheep's clothing?\nA: Im-paws-ter!",
  "Q: Why did the astronaut break up with his girlfriend?\nA: He needed his space!",
  "Q: What do you call a bear with extreme mood swings?\nA: Bi-polar bear!",
  "Q: Why did the tomato blush?\nA: It saw the salad dressing!",
  "Q: What do you call a snowman with a tan?\nA: A puddle!",
  "Q: Why did the envelope go to the doctor?\nA: It was feeling sealed!",
  "Q: What do you call a potato wearing glasses?\nA: A spec-tater!",
  "Q: Why did the mushroom get invited to every party?\nA: Because he's a fun-gi!",
  "Q: What do you call a cow with a twitch?\nA: Beef jerky!",
  "Q: Why did the rubber band get arrested?\nA: For holding up a bunch of money!",
  "Q: What do you call a sleeping bag for your feet?\nA: Socks!",
  "Q: Why did the gardener plant light bulbs?\nA: He wanted to grow a power plant!",
  "Q: What do you call a fly without wings?\nA: A walk!",
  "Q: Why did the nail go to the doctor?\nA: It had a splitting headache!",
  "Q: What do you call a man lying at your door?\nA: Matt!",
  "Q: Why did the chicken cross the playground?\nA: To get to the other slide!",
  "Q: What do you call a priest who becomes a lawyer?\nA: Father-in-law!",
  "Q: Why did the coffee bean keep checking his watch?\nA: He was pressed for time!",
  "Q: What do you call a sad watermelon?\nA: A melon-choly!",
  "Q: Why did the stop sign turn red?\nA: You'd turn red too if you had to change in the middle of the street!",
  "Q: What do you call a fish without eyes?\nA: Fsh!",
  "Q: Why did the dentist become a baseball coach?\nA: He knew the drill!",
  "Q: What do you call a monkey who sells chips?\nA: A chipmunk!",
  "Q: Why did the whale blush?\nA: It saw the ocean's bottom!",
  "Q: What do you call a sleeping T-Rex?\nA: A dino-snore!",
  "Q: Why did the rabbit eat the wedding ring?\nA: He heard it was 18 carrots!",
  "Q: What do you call a group of killer whales playing instruments?\nA: An orca-stra!",
  "Q: Why did the belt get arrested?\nA: For holding up a pair of pants!",
  "Q: What do you call a pile of kittens?\nA: A meow-tain!",
  "Q: Why did the atom go to therapy?\nA: It had splitting issues!",
  "Q: What do you call a sleeping bull?\nA: A bulldozer!",
  "Q: Why did the man put his money in the freezer?\nA: He wanted cold hard cash!",
  "Q: What do you call a Mexican who lost his car?\nA: Carlos!",
  "Q: Why did the coffee file a police report?\nA: It got mugged!",
  "Q: What do you call a sheep covered in chocolate?\nA: A candy baa!",
  "Q: Why did the orange stop in the middle of the road?\nA: It ran out of juice!",
  "Q: What do you call a train carrying bubblegum?\nA: A chew-chew train!"
]
