[
  "Q: Why did the plant go to the party?\nA: To turnip the beet!",
  "Q: What do you call a sleeping cat?\nA: A cat nap!",
  "Q: Why did the boat fail its test?\nA: It couldn't stay afloat!",
  "Q: What do you call a penguin in the desert?\nA: Lost!",
  "Q: Why did the grape stop in the road?\nA: It ran out of juice!",
  "Q: What do you call a pile of cats?\nA: A meow-ntain!",
  "Q: Why did the light bulb go to school?\nA: To get brighter!",
  "Q: What do you call a cow with no GPS?\nA: Udderly lost!",
  "Q: Why did the rope go to school?\nA: To get tied up in learning!",
  "Q: What do you call a bee having a bad hair day?\nA: A frisbee!",
  "Q: Why did the coffee file a police report?\nA: It got mugged!",
  "Q: What do you call a singing laptop?\nA: A Dell!",
  "Q: Why did the rubber band get arrested?\nA: For holding up money!",
  "Q: What do you call a man lying at your door?\nA: Matt!",
  "Q: Why did the painter get arrested?\nA: He was framed!",
  "Q: What do you call a fly without wings?\nA: A walk!",
  "Q: Why did the sandwich go to the doctor?\nA: It was feeling crummy!",
  "Q: What do you call a deer with no eyes and no legs?\nA: Still no eye-deer!",
  "Q: Why did the bird go to the hospital?\nA: For tweet-ment!",
  "Q: What do you call a nervous wreck?\nA: A brake-down!",
  "Q: Why did the drum take a nap?\nA: It was beat!",
  "Q: What do you call a dog on the beach?\nA: A hot dog!",
  "Q: Why did the football coach go to the bank?\nA: To get his quarterback!",
  "Q: What do you call a well-behaved egg?\nA: Egg-cellent!",
  "Q: Why did the nail go to the doctor?\nA: It had a splitting headache!",
  "Q: What do you call a pig that does karate?\nA: A pork chop!",
  "Q: Why did the moon skip dinner?\nA: It was full!",
  "Q: What do you call a train loaded with bubblegum?\nA: A chew-chew train!",
  "Q: Why did the chicken go to the séance?\nA: To talk to the other side!",
  "Q: What do you call a magical dog?\nA: A labracadabrador!",
  "Q: Why did the banana wear sunscreen?\nA: It didn't want to peel!",
  "Q: What do you call a dinosaur that crashes his car?\nA: Tyrannosaurus Wrecks!",
  "Q: Why did the robot go on vacation?\nA: To recharge!",
  "Q: What do you call a sheep covered in chocolate?\nA: A candy baa!",
  "Q: Why did the mushroom get invited to parties?\nA: He was a fungi!",
  "Q: What do you call a nervous zucchini?\nA: An anxious squash!",
  "Q: Why did the gardener plant light bulbs?\nA: To grow a power plant!",
  "Q: What do you call a bear with extreme mood swings?\nA: A bi-polar bear!",
  "Q: Why did the bicycle go to therapy?\nA: It couldn't handle the cycle!",
  "Q: What do you call a magic owl?\nA: Hoo-dini!",
  "Q: Why did the baker go broke?\nA: He made too much dough!",
  "Q: What do you call a thief who steals energy drinks?\nA: A Red Bull-y!",
  "Q: Why did the paper go to the doctor?\nA: It was feeling stationary!",
  "Q: What do you call a Mexican who lost his car?\nA: Carlos!",
  "Q: Why did the potato get arrested?\nA: It was a mash-up!",
  "Q: What do you call a sleeping dinosaur?\nA: A dino-snore!",
  "Q: Why did the smartphone go to therapy?\nA: It had app-xiety!",
  "Q: What do you call a fish that practices medicine?\nA: A sturgeon!",
  "Q: Why did the scarecrow get a Nobel Prize?\nA: He was out-standing in his field!",
  "Q: What do you call an ant who fights crime?\nA: A vigilante!",
  "Q: Why did the duck get kicked out of the restaurant?\nA: He put everything on his bill!",
  "Q: What do you call a group of disorganized cats?\nA: A cat-astrophe!",
  "Q: Why did the invisible man turn down the job?\nA: He couldn't see himself doing it!",
  "Q: What do you call a sad watermelon?\nA: A melon-choly!",
  "Q: Why did the octopus beat the shark in a fight?\nA: It was well-armed!",
  "Q: What do you call a cow that's just given birth?\nA: De-calf-inated!",
  "Q: Why did the quarter not roll down the hill?\nA: It had more cents!",
  "Q: What do you call a sleeping bee?\nA: Un-bee-lievable!",
  "Q: Why did the math teacher open a bakery?\nA: She knew how to make pi!",
  "Q: What do you call a fake noodle?\nA: An impasta!",
  "Q: Why did the dentist become a baseball coach?\nA: He knew the drill!",
  "Q: What do you call a cow with a twitch?\nA: Beef jerky!",
  "Q: Why did the lemon fail its driving test?\nA: It kept peeling out!",
  "Q: What do you call a knight afraid of battle?\nA: Sir Render!",
  "Q: Why did the traffic light turn red?\nA: You'd turn red too if you changed in public!",
  "Q: What do you call a parade of rabbits going backwards?\nA: A receding hare-line!",
  "Q: Why did the whale blush?\nA: It saw the ocean's bottom!",
  "Q: What do you call a sketchy Italian neighborhood?\nA: The spaghetto!",
  "Q: Why did the duck become a detective?\nA: To quack the case!",
  "Q: What do you call a priest who becomes a lawyer?\nA: Father-in-law!",
  "Q: Why did the baker need therapy?\nA: He kneaded someone to talk to!",
  "Q: What do you call a monkey who sells chips?\nA: A chipmunk!",
  "Q: Why did the photographer go to jail?\nA: For shooting people!",
  "Q: What do you call a rabbit that tells jokes?\nA: A funny bunny!",
  "Q: Why did the restaurant hire a pig?\nA: He was great at bacon people smile!",
  "Q: What do you call an illegally parked frog?\nA: Toad!",
  "Q: Why did the man put money in the freezer?\nA: He wanted cold hard cash!",
  "Q: What do you call a sleeping bag for babies?\nA: A nap-sack!",
  "Q: Why did the rabbit eat the wedding ring?\nA: He heard it was 18 carrots!",
  "Q: What do you call a well-dressed lion?\nA: A dandy-lion!",
  "Q: Why did the atom go to therapy?\nA: It had splitting issues!",
  "Q: What do you call a fake stone in Ireland?\nA: A sham-rock!",
  "Q: Why did the stop sign turn red?\nA: You'd turn red if you changed in the street!",
  "Q: What do you call a fish with two knees?\nA: A two-knee fish!",
  "Q: Why did the egg go to therapy?\nA: It couldn't get out of its shell!",
  "Q: What do you call a cow eating grass?\nA: A lawn moo-er!",
  "Q: Why did the balloon go near the needle?\nA: It wanted to be a pop star!",
  "Q: What do you call a sleeping T-Rex?\nA: A dino-snore!",
  "Q: Why did the gardener plant seeds in the pond?\nA: To grow watermelons!",
  "Q: What do you call a bear in the rain?\nA: A drizzly bear!",
  "Q: Why did the vacuum go to therapy?\nA: It was tired of people's dirt!",
  "Q: What do you call a laughing motorcycle?\nA: A Yamahahaha!",
  "Q: Why did the comb get arrested?\nA: For parting!",
  "Q: What do you call a shoe made of a banana?\nA: A slipper!",
  "Q: Why did the sock go to therapy?\nA: It had a hole in its sole!",
  "Q: What do you call a dog magician?\nA: A labracadabrador!",
  "Q: Why did the musician get locked out?\nA: He had the wrong key!"
]
