[
  "Q: Why did the window go to school?\nA: To get a pane-education!",
  "Q: What do you call a nervous computer?\nA: Tech-nically anxious!",
  "Q: Why did the shoe go on a diet?\nA: It had too many laces!",
  "Q: What do you call a sleeping guitar?\nA: A rest note!",
  "Q: Why did the umbrella go to therapy?\nA: It felt under the weather!",
  "Q: What do you call a happy battery?\nA: Charged up!",
  "Q: Why did the soap feel clean?\nA: It washed away its problems!",
  "Q: What do you call a musical spoon?\nA: A tuning spork!",
  "Q: Why did the lightswitch feel powerful?\nA: It was in control!",
  "Q: What do you call a tired candle?\nA: Burned out!",
  "Q: Why did the remote control go to college?\nA: To channel its energy!",
  "Q: What do you call a smart toaster?\nA: Well bread!",
  "Q: Why did the mop feel down?\nA: It was in a sticky situation!",
  "Q: What do you call a sleeping alarm clock?\nA: Ironic!",
  "Q: Why did the bucket feel empty?\nA: It needed to be filled in!",
  "Q: What do you call a running fan?\nA: A big fan!",
  "Q: Why did the mirror feel reflective?\nA: It was having a moment!",
  "Q: What do you call a musical vacuum?\nA: A hum-dinger!",
  "Q: Why did the doorbell go to the doctor?\nA: It had a ringing in its ears!",
  "Q: What do you call a nervous microwave?\nA: Heated anxiety!",
  "Q: Why did the fridge feel cold?\nA: It lost its cool!",
  "Q: What do you call a happy washing machine?\nA: Loads of fun!",
  "Q: Why did the dryer feel hot?\nA: It was tumbling with emotions!",
  "Q: What do you call a sleeping oven?\nA: Baked!",
  "Q: Why did the blender feel mixed up?\nA: It was in a whirl!",
  "Q: What do you call a smart dishwasher?\nA: Squeaky clean!",
  "Q: Why did the kettle feel steamed?\nA: It was boiling mad!",
  "Q: What do you call a tired iron?\nA: Pressed for time!",
  "Q: Why did the trash can feel empty?\nA: It was rubbish!",
  "Q: What do you call a musical radiator?\nA: A heat beat!",
  "Q: Why did the thermostat feel important?\nA: It controlled the atmosphere!",
  "Q: What do you call a nervous smoke detector?\nA: On fire with anxiety!",
  "Q: Why did the lightbulb feel bright?\nA: It had a light bulb moment!",
  "Q: What do you call a sleeping TV?\nA: Off-air!",
  "Q: Why did the speaker feel loud?\nA: It was amplified!",
  "Q: What do you call a happy printer?\nA: In good form!",
  "Q: Why did the keyboard feel pressured?\nA: Too many keys to handle!",
  "Q: What do you call a tired mouse?\nA: Clicked out!",
  "Q: Why did the monitor go to therapy?\nA: It had screen issues!",
  "Q: What do you call a musical calculator?\nA: Number one with a beat!",
  "Q: Why did the webcam feel watched?\nA: It was under surveillance!",
  "Q: What do you call a nervous USB drive?\nA: Stick with anxiety!",
  "Q: Why did the charger feel drained?\nA: It gave too much!",
  "Q: What do you call a happy headphone?\nA: In tune!",
  "Q: Why did the router feel connected?\nA: It was networking!",
  "Q: What do you call a sleeping modem?\nA: Off-line!",
  "Q: Why did the hard drive feel full?\nA: It had too much data!",
  "Q: What do you call a smart tablet?\nA: App-solutely brilliant!",
  "Q: Why did the stylus feel pointed?\nA: It had a sharp wit!",
  "Q: What do you call a tired laptop?\nA: Shut down!",
  "Q: Why did the memory card feel forgotten?\nA: It lost its storage!",
  "Q: What do you call a musical CPU?\nA: Processing power!",
  "Q: Why did the GPU feel hot?\nA: It was rendering emotions!",
  "Q: What do you call a nervous motherboard?\nA: Circuit-ously anxious!",
  "Q: Why did the RAM feel rushed?\nA: It was running out of memory!",
  "Q: What do you call a happy SSD?\nA: Solid state of mind!",
  "Q: Why did the cooling fan feel breezy?\nA: It was chilling out!",
  "Q: What do you call a tired power supply?\nA: Out of juice!",
  "Q: Why did the graphics card feel artistic?\nA: It rendered beautifully!",
  "Q: What do you call a musical optical drive?\nA: CD you later!",
  "Q: Why did the case feel protective?\nA: It was covering for others!",
  "Q: What do you call a nervous cable?\nA: Tied up in knots!",
  "Q: Why did the connector feel plugged in?\nA: It made a connection!",
  "Q: What do you call a happy adapter?\nA: Well adjusted!",
  "Q: Why did the extension cord feel stretched?\nA: It was reaching out!",
  "Q: What do you call a tired surge protector?\nA: Overloaded!",
  "Q: Why did the outlet feel powerful?\nA: It was current!",
  "Q: What do you call a musical circuit breaker?\nA: A shocking performance!",
  "Q: Why did the wire feel connected?\nA: It was live!",
  "Q: What do you call a nervous fuse?\nA: Short-tempered!",
  "Q: Why did the switch feel decisive?\nA: It was on or off about things!",
  "Q: What do you call a happy relay?\nA: Switched on!",
  "Q: Why did the resistor feel opposed?\nA: It was resisting change!",
  "Q: What do you call a tired capacitor?\nA: Dis-charged!",
  "Q: Why did the transistor feel amplified?\nA: It was conducting itself well!",
  "Q: What do you call a musical diode?\nA: One-way beat!",
  "Q: Why did the LED feel bright?\nA: It was illuminating!",
  "Q: What do you call a nervous sensor?\nA: Overly sensitive!",
  "Q: Why did the actuator feel active?\nA: It was in motion!",
  "Q: What do you call a happy servo?\nA: Well positioned!",
  "Q: Why did the motor feel driven?\nA: It had momentum!",
  "Q: What do you call a tired generator?\nA: Out of power!",
  "Q: Why did the alternator feel current?\nA: It was generating excitement!",
  "Q: What do you call a musical transformer?\nA: More than meets the ear!",
  "Q: Why did the inverter feel opposite?\nA: It was going against the flow!",
  "Q: What do you call a nervous rectifier?\nA: Straight-laced!",
  "Q: Why did the oscillator feel wavy?\nA: It was going through phases!",
  "Q: What do you call a happy amplifier?\nA: Loud and proud!",
  "Q: Why did the filter feel selective?\nA: It had standards!",
  "Q: What do you call a tired regulator?\nA: Out of control!",
  "Q: Why did the controller feel bossy?\nA: It was in command!",
  "Q: What do you call a musical decoder?\nA: Breaking down the beat!",
  "Q: Why did the encoder feel compressed?\nA: It was under pressure!",
  "Q: What do you call a nervous multiplexer?\nA: Multi-anxious!",
  "Q: Why did the demultiplexer feel divided?\nA: It was splitting up!",
  "Q: What do you call a happy logic gate?\nA: Positively charged!"
]
