[
  "Q: Why did the robot go on vacation?\nA: It needed to recharge its batteries!",
  "Q: What do you call a knight who is afraid of battle?\nA: Sir Render!",
  "Q: Why did the magician refuse to reveal his trick?\nA: He wanted to keep it under wraps!",
  "Q: What do you call a snowman in summer?\nA: A puddle!",
  "Q: Why did the lemon fail its driving test?\nA: It kept peeling out!",
  "Q: What do you call a group of rabbits hopping backwards?\nA: A receding hare-line!",
  "Q: Why did the dentist become a baseball coach?\nA: He knew the drill!",
  "Q: What do you call a cow with a sense of humor?\nA: Laughing stock!",
  "Q: Why did the rope go to school?\nA: To get tied up in learning!",
  "Q: What do you call a bear without teeth?\nA: A gummy bear!",
  "Q: Why did the chicken cross the playground?\nA: To get to the other slide!",
  "Q: What do you call a well-mannered reptile?\nA: A civil-ization!",
  "Q: Why did the book join the police?\nA: It wanted to go undercover!",
  "Q: What do you call a sad strawberry?\nA: A blue-berry!",
  "Q: Why did the flashlight go to school?\nA: To get brighter!",
  "Q: What do you call a thief who steals coffee?\nA: A mug-ler!",
  "Q: Why did the bee get married?\nA: Because it found its honey!",
  "Q: What do you call a frozen  dog?\nA: A pupsicle!",
  "Q: Why did the student eat his homework?\nA: The teacher told him it was a piece of cake!",
  "Q: What do you call a religious insect?\nA: A mosque-ito!",
  "Q: Why did the cell phone need glasses?\nA: It lost its contacts!",
  "Q: What do you call a dancing sheep?\nA: A baaaah-llerina!",
  "Q: Why did the boat go to the doctor?\nA: It felt a little dinghy!",
  "Q: What do you call a wealthy elf?\nA: Welfy!",
  "Q: Why did the banker switch careers?\nA: He lost interest!",
  "Q: What do you call a dog that does magic?\nA: A labracadabrador!",
  "Q: Why did the grape stop in the middle of the road?\nA: It ran out of juice!",
  "Q: What do you call a man with a rubber toe?\nA: Roberto!",
  "Q: Why did the farmer win an award?\nA: He was outstanding in his field!",
  "Q: What do you call a pig that knows martial arts?\nA: Pork chop!",
  "Q: Why did the coffee bean keep checking his watch?\nA: He was pressed for time!",
  "Q: What do you call an ant who fights crime?\nA: A vigilante!",
  "Q: Why did the astronaut break up with his girlfriend?\nA: He needed space!",
  "Q: What do you call a sleeping bee?\nA: Un-bee-lievable!",
  "Q: Why did the painting go to jail?\nA: It was framed!",
  "Q: What do you call a fish that practices medicine?\nA: A sturgeon!",
  "Q: Why did the belt get arrested?\nA: For holding up pants!",
  "Q: What do you call a mountain that tells jokes?\nA: Hill-arious!",
  "Q: Why did the scarecrow get a promotion?\nA: He was outstanding in his field!",
  "Q: What do you call a group of killer whales playing music?\nA: An orca-stra!",
  "Q: Why did the cookie see a therapist?\nA: It felt crumbly inside!",
  "Q: What do you call a haunted chicken?\nA: A poultry-geist!",
  "Q: Why did the number seven eat nine?\nA: Because you're supposed to eat three squared meals a day!",
  "Q: What do you call a fake Irish stone?\nA: A sham-rock!",
  "Q: Why did the donut visit the dentist?\nA: It needed a filling!",
  "Q: What do you call a bear with extreme mood swings?\nA: A bi-polar bear!",
  "Q: Why did the pencil need a vacation?\nA: It was feeling quite dull!",
  "Q: What do you call a cow with no legs?\nA: Ground beef!",
  "Q: Why did the lettuce win the race?\nA: It was a head!",
  "Q: What do you call an alligator in a vest?\nA: An investigator!",
  "Q: Why did the duck cross the road?\nA: To prove he wasn't a chicken!",
  "Q: What do you call a sleeping pizza?\nA: A piZZZa!",
  "Q: Why did the calendar go to the doctor?\nA: It had a date that wouldn't go away!",
  "Q: What do you call a deer with no eyes and no legs?\nA: Still no eye-deer!",
  "Q: Why did the bicycle fall over?\nA: It was two tired!",
  "Q: What do you call a pile of cats?\nA: A meow-tain!",
  "Q: Why did the mushroom go to the party?\nA: He was a fungi!",
  "Q: What do you call a nervous javelin?\nA: Shakespeare!",
  "Q: Why did the tomato blush?\nA: It saw the salad dressing!",
  "Q: What do you call a fake noodle?\nA: An impasta!",
  "Q: Why did the belt go to therapy?\nA: It felt like it was always being held back!",
  "Q: What do you call a kangaroo that's a DJ?\nA: A hip-hopper!",
  "Q: Why did the math book look so worried?\nA: Because it had too many problems!",
  "Q: What do you call a sleeping bull?\nA: A bulldozer!",
  "Q: Why did the scarecrow win an award?\nA: He was outstanding in his field!",
  "Q: What do you call a fish with two knees?\nA: A two-knee fish!",
  "Q: Why did the stadium get hot after the game?\nA: All the fans left!",
  "Q: What do you call cheese that's not yours?\nA: Nacho cheese!",
  "Q: Why did the traffic light turn red?\nA: You would too if you had to change in the street!",
  "Q: What do you call a dinosaur that crashes his car?\nA: Tyrannosaurus Wrecks!",
  "Q: Why did the golfer bring extra socks?\nA: In case he got a hole in one!",
  "Q: What do you call a snowman with abs?\nA: An abdominal snowman!",
  "Q: Why did the laptop go to the doctor?\nA: It had a virus!",
  "Q: What do you call a line of rabbits going backward?\nA: A receding hareline!",
  "Q: Why did the egg hide?\nA: It was a little chicken!",
  "Q: What do you call a happy cowboy?\nA: A jolly rancher!",
  "Q: Why did the orange stop rolling down the hill?\nA: It ran out of juice!",
  "Q: What do you call a sleeping forest?\nA: A lumber yard!",
  "Q: Why did the skeleton go to the party alone?\nA: He had no body to go with!",
  "Q: What do you call a train loaded with toffee?\nA: A chew-chew train!",
  "Q: Why did the cloud go to therapy?\nA: It had trouble reigning in its emotions!",
  "Q: What do you call an elephant that doesn't matter?\nA: Irrelephant!",
  "Q: Why did the can crusher quit his job?\nA: It was soda pressing!",
  "Q: What do you call a boomerang that doesn't come back?\nA: A stick!",
  "Q: Why did the yogurt go to the art exhibit?\nA: Because it was cultured!",
  "Q: What do you call a sleeping dinosaur?\nA: A dino-snore!",
  "Q: Why did the tree go to the dentist?\nA: It needed a root canal!",
  "Q: What do you call a magic owl?\nA: Hoo-dini!",
  "Q: Why did the phone wear glasses?\nA: It lost all its contacts!",
  "Q: What do you call a sad cup of coffee?\nA: A depresso!",
  "Q: Why did the computer catch a cold?\nA: It left its Windows open!",
  "Q: What do you call a bear in the rain?\nA: A drizzly bear!",
  "Q: Why did the baker go to therapy?\nA: He kneaded someone to talk to!",
  "Q: What do you call a lazy kangaroo?\nA: A pouch potato!",
  "Q: Why did the clock get in trouble?\nA: It tocked too much!",
  "Q: What do you call a vegetable that's cool?\nA: A rad-ish!",
  "Q: Why did the toilet paper roll down the hill?\nA: To get to the bottom!",
  "Q: What do you call a monkey in a minefield?\nA: A baboom!"
]
