[
  "Q: Why did the melon jump into the lake?\nA: It wanted to be a watermelon!",
  "Q: What do you call a fake pasta?\nA: An impasta!",
  "Q: Why did the crab never share?\nA: Because it was shellfish!",
  "Q: What do you call a shoe made from a banana?\nA: A slipper!",
  "Q: Why did the hipster burn his mouth?\nA: He drank coffee before it was cool!",
  "Q: What do you call a factory that makes good products?\nA: A satisfactory!",
  "Q: Why did the octopus beat the shark in a fight?\nA: It was well armed!",
  "Q: What do you call a sleeping bag?\nA: A nap sack!",
  "Q: Why did the quarter not roll down the hill with the nickel?\nA: Because it had more cents!",
  "Q: What do you call a pile of cats?\nA: A meow-ntain!",
  "Q: Why did the can crusher quit his job?\nA: Because it was soda pressing!",
  "Q: What do you call a religious bug?\nA: A mosque-ito!",
  "Q: Why did the bird go to the hospital?\nA: For tweet-ment!",
  "Q: What do you call a bear caught in the rain?\nA: A drizzly bear!",
  "Q: Why did the computer keep freezing?\nA: It left its Windows open!",
  "Q: What do you call a lazy kangaroo?\nA: A pouch potato!",
  "Q: Why did the snowman call his dog Frost?\nA: Because Frost bites!",
  "Q: What do you call a boomerang that doesn't work?\nA: A stick!",
  "Q: Why did the baker stop making donuts?\nA: He was tired of the hole business!",
  "Q: What do you call a psychic dwarf who escaped from prison?\nA: A small medium at large!",
  "Q: Why did the golfer wear two pairs of pants?\nA: In case he got a hole in one!",
  "Q: What do you call a haunted chicken?\nA: A poultry-geist!",
  "Q: Why did the orange lose the race?\nA: It ran out of juice!",
  "Q: What do you call a deer with no eyes?\nA: No eye-deer!",
  "Q: Why did the cookie go to the nurse?\nA: It felt crummy!",
  "Q: What do you call a train carrying toffee?\nA: A chew-chew train!",
  "Q: Why did the stadium get hot?\nA: All the fans left!",
  "Q: What do you call an elephant that doesn't matter?\nA: Irrelephant!",
  "Q: Why did the bicycle fall asleep?\nA: It was two-tired!",
  "Q: What do you call a magic owl?\nA: Hoo-dini!",
  "Q: Why did the drum take a nap?\nA: It was beat!",
  "Q: What do you call a fish that wears a crown?\nA: King of the sea!",
  "Q: Why did the pepper put on a sweater?\nA: It was a little chili!",
  "Q: What do you call a T-rex that loves Mexican food?\nA: Tyrannosaurus Mex!",
  "Q: Why did the scarecrow get promoted?\nA: He was outstanding in his field!",
  "Q: What do you call a cow with no GPS?\nA: Udderly lost!",
  "Q: Why did the banana go out with a prune?\nA: Because it couldn't get a date!",
  "Q: What do you call a pig that knows karate?\nA: A pork chop!",
  "Q: Why did the book go to the doctor?\nA: It had a spine problem!",
  "Q: What do you call a sleeping forest?\nA: A lum-ber yard!",
  "Q: Why did the chicken go to KFC?\nA: To see a chicken strip!",
  "Q: What do you call a alligator detective?\nA: An investi-gator!",
  "Q: Why did the man put his car in the oven?\nA: He wanted a hot rod!",
  "Q: What do you call a singing computer?\nA: A-Dell!",
  "Q: Why did the cookie visit a therapist?\nA: It was feeling crumbly about life!",
  "Q: What do you call a rooster on top of a barn?\nA: A cock of the walk!",
  "Q: Why did the math book look worried?\nA: It had too many problems!",
  "Q: What do you call a funny mountain?\nA: Hill-arious!",
  "Q: Why did the tomato turn red?\nA: It saw the salad dressing!",
  "Q: What do you call a belt with a watch?\nA: A waist of time!",
  "Q: Why did the invisible man refuse the job offer?\nA: He couldn't see himself doing it!",
  "Q: What do you call a group of unorganized cats?\nA: A cat-astrophe!",
  "Q: Why did the calendar go to therapy?\nA: Its days were numbered!",
  "Q: What do you call a sad cup of coffee?\nA: A depresso!",
  "Q: Why did the belt get locked up?\nA: It held up a pair of pants!",
  "Q: What do you call a dog that does magic tricks?\nA: A labracadabrador!",
  "Q: Why did the plant go to the party?\nA: It wanted to branch out!",
  "Q: What do you call a lazy egg?\nA: An eggs-cuse!",
  "Q: Why did the banana wear sunscreen?\nA: To avoid peeling!",
  "Q: What do you call a fake Irish stone?\nA: A sham-rock!",
  "Q: Why did the toilet paper roll down the hill?\nA: To get to the bottom!",
  "Q: What do you call a sleeping dinosaur?\nA: A dino-snore!",
  "Q: Why did the mushroom go to the party?\nA: He's a fungi to be with!",
  "Q: What do you call a bear with no ears?\nA: B!",
  "Q: Why did the smartphone need glasses?\nA: It lost all its contacts!",
  "Q: What do you call a nervous javelin thrower?\nA: Shakespeare!",
  "Q: Why did the vacuum quit?\nA: It was tired of being pushed around!",
  "Q: What do you call a frozen dog?\nA: A pup-sicle!",
  "Q: Why did the picture go to jail?\nA: It was framed!",
  "Q: What do you call a cow that just had a baby?\nA: De-calf-inated!",
  "Q: Why did the donut go to the dentist?\nA: It needed a filling!",
  "Q: What do you call a dancing sheep?\nA: A baaaah-llerina!",
  "Q: Why did the scarecrow win an award?\nA: He was outstanding in his field!",
  "Q: What do you call an unpredictable camera?\nA: A loose Canon!",
  "Q: Why did the skeleton refuse to go to the party?\nA: He had no body to dance with!",
  "Q: What do you call a fish that needs help?\nA: A bassistant!",
  "Q: Why did the gym close down?\nA: It didn't work out!",
  "Q: What do you call a sketchy Italian neighborhood?\nA: The spaghetto!",
  "Q: Why did the cell phone wear glasses?\nA: Because it lost all its contacts!",
  "Q: What do you call a mountain that tells jokes?\nA: Hill-arious!",
  "Q: Why did the bread go to therapy?\nA: It needed to get things off its crust!",
  "Q: What do you call an angry carrot?\nA: A steamed veggie!",
  "Q: Why did the farmer ride his horse to town?\nA: It was too heavy to carry!",
  "Q: What do you call a pig that plays basketball?\nA: A ball hog!",
  "Q: Why did the balloon go near the needle?\nA: It wanted to be a pop star!",
  "Q: What do you call a sleeping pizza?\nA: A piZZZa!",
  "Q: Why did the lettuce close its eyes?\nA: So it could make a salad dressing!",
  "Q: What do you call a retired vegetable?\nA: A has-bean!",
  "Q: Why did the golfer bring an extra shirt?\nA: In case he got a hole in one!",
  "Q: What do you call a wolf in a sheep's clothing?\nA: An impaws-ter!",
  "Q: Why did the scarecrow become a therapist?\nA: He was good at helping people with their fields!",
  "Q: What do you call a lazy baby kangaroo?\nA: A pouch potato!",
  "Q: Why did the clock get in trouble at school?\nA: It tocked too much!",
  "Q: What do you call a dinosaur that crashes his car?\nA: Tyrannosaurus Wrecks!",
  "Q: Why did the baker go broke?\nA: He made too much dough!",
  "Q: What do you call a sleeping cow?\nA: A bull-dozer!",
  "Q: Why did the pencil go to school?\nA: To get sharper!",
  "Q: What do you call a monkey in a mine field?\nA: A baboom!"
]
